{"id": 271, "text": "With both teams coming off disappointing defeats in the opening round of the tournament, FaZe and TYLOO faced off to keep their heads above water as elimination loomed. The European side took control of proceedings early on the CT side of Inferno to attain a 5-3 lead, but the slight advantage dissipated quickly as TYLOO consistently opened up the ensuing rounds by dominating in duels. Finding themselves a player down to the lost duels, FaZe crumbled as TYLOO, spearheaded by an impressive performance from Hansel \"BnTeT\" Ferdinand, rolled over the defence to secure a 10-5 lead at the halfway mark. FaZe could only muster two additional rounds at the beginning of the second half as TYLOO continued to run rampant, locking down a six-round streak to close out the map, with a triple AWP kill at the hands of BnTeT concluding the map 16-7. A revitalised FaZe came out of the gates hot on the T side of Dust2, with a crisp quad kill from Håvard \"rain\" Nygaard on the P250 kicking off a hugely one-sided half. Nikola \"NiKo\" Kovač's men continued to fire on all cylinders into halftime, earning themselves a commanding 13-2 lead. A spurt of resistance surfaced from TYLOO as the two teams swapped sides, but any chance of a comeback from the Chinese squad was crushed swiftly as FaZe levelled the series with a 16-5 map victory.Mirage played host to the decider, where the two squads could not be separated after the opening few rounds. However, a ridiculous 1v2 clutch from NiKo, which included a Marcelo \"coldzera\" David-inspired jump shot, turned the tide in FaZe’s favour as the European mixture pulled ahead before switching to the Terrorist side with a 10-5 advantage. Running with the momentum of the first half, FaZe maintained their dominance to brush TYLOO aside briskly, 16-7, to win out the series 2-1 and secure their place in the next round of Group B's lower bracket, in which they will face the loser of the match between Evil Geniuses and 100 Thieves.", "meta": {}, "annotation_approver": null, "labels": [[98, 103, "ORG"], [89, 93, "ORG"], [316, 321, "ORG"], [440, 444, "ORG"], [457, 462, "ORG"], [510, 534, "PLAYER"], [603, 607, "ORG"], [687, 692, "ORG"], [812, 817, "PLAYER"], [857, 861, "ORG"], [940, 961, "PLAYER"], [1011, 1032, "PLAYER"], [1166, 1171, "ORG"], [1279, 1283, "ORG"], [1475, 1479, "PLAYER"], [1498, 1531, "PLAYER"], [1562, 1568, "ORG"], [1720, 1724, "ORG"], [1761, 1766, "ORG"], [1938, 1951, "ORG"], [1956, 1967, "ORG"], [787, 790, "AVATAR"], [969, 973, "AVATAR"]]}
{"id": 272, "text": "The Brazilian team will be joining two other invited sides, ENCE and G2, alongside five teams who made it to the $300,000 Maltese event after participating in qualifiers in Europe and China. At the moment, FURIA are the second-highest ranked team out of the eight participants behind the Finns, which puts them as one of the main favorites. They have not done well in that position, however, as they went out in third-fourth place at Games Clash Masters in September and, more recently, in the group stage at DreamHack Open Winter. Andrei \"arT\" Piovezan's side will travel to one other tournament before the end of the year, as they have also been invited to play at cs_summit 5, taking place just a few days prior to the Champions Cup Finals (December 12-15). The complete team list for the Champions Cup Finals, which will run from December 19-22 in Saint Julian's in Malta, looks as follows: Finland ENCE  France G2 Russia Hard Legion Spain Movistar Riders Brazil FURIA China TYLOO Germany BIG Russia Spirit", "meta": {}, "annotation_approver": null, "labels": [[60, 64, "ORG"], [69, 71, "ORG"], [206, 211, "ORG"], [288, 293, "ORG"], [434, 453, "TOURN"], [509, 530, "TOURN"], [532, 555, "PLAYER"], [667, 678, "TOURN"], [903, 907, "ORG"], [916, 918, "ORG"], [926, 937, "ORG"], [944, 959, "ORG"], [967, 972, "ORG"], [979, 984, "ORG"], [993, 996, "ORG"], [1004, 1010, "ORG"], [722, 742, "TOURN"], [792, 812, "TOURN"]]}
{"id": 273, "text": "After coming in late from their travels from overseas, Liquid had another surprise waiting for them in Denmark in the form of a Vertigo pick from North, who had previously never played the map before. The Danish side started off well on the back of a pistol round win and a 1v2 clutch from Jakob \"JUGi\" Hansen in the following anti-forcebuy, but their 3-0 lead was quickly answered with a four-round streak from the North American side, who had Jake \"Stewie2K\" Yip, Russel \"Twistzz\" Van Dulken, and Jonathan \"EliGE\" Jablonowski pull individual plays out of the bag. The two teams traded three-round streaks as the half was coming to a close, with the team around Nicklas \"gade\" Gade eventually clinching a one-round advantage before switching over to Counter-Terrorists. Liquid reclaimed the lead with the first four rounds, preferring the B bombsite and leaving North to save weapons twice, before the Danes brought it back to a one-round difference as they found an answer to the onslaught. But with another clutch from Twistzz, this time a 1v3, and an ace from EliGE in a tough anti-halfbuy scenario, the favored team reached match point and soon closed the map at 16-12, joining mousesports in a playoffs-deciding series in Group B.", "meta": {}, "annotation_approver": null, "labels": [[55, 61, "ORG"], [290, 309, "PLAYER"], [466, 493, "PLAYER"], [499, 527, "PLAYER"], [663, 682, "PLAYER"], [771, 777, "ORG"], [1022, 1029, "PLAYER"], [1064, 1069, "PLAYER"], [1183, 1194, "ORG"], [445, 464, "PLAYER"], [146, 151, "ORG"], [863, 868, "ORG"]]}
{"id": 274, "text": "The two organisations are already locked in talks as MIBR look to thrash out a deal before their final event of the year, cs_summit 5, which will be held between December 12-15. meyern has been on Sharks' books for less than four months, having been recruited from Isurus in August after impressing for the Argentinian side. The 17-year-old talent, who was featured in our \"One for the future\" series, has averaged a 1.24 rating while with Sharks and could play his final match for the team on Wednesday, in the ESL Pro League Season 10 Finals clash with Renegades. MIBR set their sights on meyern as they look to add more firepower to the squad, replacing Lucas \"LUCAS1\" Teles. The 24-year-old has averaged a 1.04 rating since his arrival in June, initially on a loan deal from Luminosity. If confirmed, this change will leave MIBR with: Brazil Gabriel \"FalleN\" Toledo Brazil Fernando \"fer\" Alvarenga Brazil Epitacio \"TACO\" de Melo Brazil Vito \"kNgV-\" Giuseppe Argentina Ignacio \"meyern\" Meyer Brazil Lucas \"LUCAS1\" Teles (substitute) Brazil João \"felps\" Vasconcellos (substitute) Brazil Wilton \"zews\" Prado (coach)", "meta": {}, "annotation_approver": null, "labels": [[53, 57, "ORG"], [122, 133, "TOURN"], [178, 184, "PLAYER"], [265, 271, "ORG"], [440, 446, "ORG"], [555, 564, "ORG"], [566, 570, "ORG"], [591, 597, "PLAYER"], [657, 677, "PLAYER"], [779, 789, "ORG"], [828, 832, "ORG"], [846, 869, "PLAYER"], [877, 901, "PLAYER"], [909, 932, "PLAYER"], [940, 961, "PLAYER"], [972, 994, "PLAYER"], [1002, 1022, "PLAYER"], [1043, 1068, "PLAYER"], [512, 536, "TOURN"], [197, 203, "ORG"]]}
{"id": 275, "text": "The Russian team put up a masterclass of a performance to send an uninspired MIBR side to the lower bracket of Group A. The Brazilians went into the break down by nine rounds on both maps following slow starts as Natus Vincere ran rampant from the offset. Kirill \"Boombl4\" Mikhailov's troops will take on the winner of the match between Evil Geniuses and 100 Thieves for a spot in the semi-finals, with the loser of that match being placed in the quarter-finals. Na`Vi came out with all guns blazing on Train, MIBR's pick, and held the Terrorist players at bay during the early stages of the game with some quality AWP shots from Aleksandr \"s1mple\" Kostyliev, who by the seventh round already had 14 frags to his name. It was only when MIBR were down 0-8 that they finally managed to show a reaction, but the rounds that they won until the end of the half were few and far between as Natus Vincere took a commanding 12-3 lead. MIBR kept themselves alive in the game as they took the pistol round with ease and then put together a deadly double AWP set-up. Na`Vi were starting to feel the pressure as rounds kept going the Brazilians' way, but all it took was one successful eco round for the tide to shift. Natus Vincere followed that up with one round, leaving MIBR's economy in tatters, and ran away with the game, with Egor \"flamie\" Vasilyev striking the finishing blow with a quad-kill. The Russian team carried that momentum into the next map, Dust2, and stormed to a 6-0 lead on the Terrorist side. After a technical break, MIBR finally managed to get on the board, but just like on Train they were unable to build on the few rounds that went their way and were limited to just three rounds in the half. Things then went from bad to worse for MIBR as they lost the pistol round after three of their players hit a brick wall in catwalk called s1mple. Once they had money in the bank, the Brazilians still attempted a response, but by then they were simply too far behind to catch up to their opponents.", "meta": {}, "annotation_approver": null, "labels": [[77, 81, "ORG"], [213, 226, "ORG"], [337, 350, "ORG"], [355, 366, "ORG"], [463, 468, "ORG"], [630, 658, "PLAYER"], [736, 740, "ORG"], [884, 897, "ORG"], [1056, 1061, "ORG"], [1207, 1220, "ORG"], [1322, 1344, "PLAYER"], [1530, 1534, "ORG"], [1749, 1753, "ORG"], [1848, 1854, "PLAYER"], [256, 282, "PLAYER"], [510, 514, "ORG"], [1262, 1266, "ORG"], [1044, 1047, "AVATAR"]]}
{"id": 276, "text": "The news comes the day after North confirmed the sale of Valdemar \"valde\" Bjørn Vangså to an unnamed team amidst reports of a new lineup being formed under Dota 2 brand OG featuring the Frenchman, Aleksi \"Aleksib\" Virolainen, Issa \"ISSAA\" Murad, and Mateusz \"mantuu\" Wilczewski. NBK- had been a part of Vitality since the organization's entrance into CS:GO in October 2018 with a then-all-new squad formed around Mathieu \"ZywOo\" Herbaut, with the 25-year-old playing in the active lineup for most of the following year until he was replaced by Richard \"shox\" Papillon in September. Fulfilling the role of the captain and, at times, the in-game leader, NBK- helped the French side explode onto the scene in the first half of 2019 with wins at cs_summit 4 and ECS Season 7 Finals, as well as a runner-up finish at ESL One Cologne. Vitality peaked at No.2 in the world ranking for the majority of a two-month period after their campaign in Cologne, but more recently they dropped out of the top five for the first time since May following up-and-down results with the new lineup.", "meta": {}, "annotation_approver": null, "labels": [[57, 86, "PLAYER"], [29, 34, "ORG"], [156, 162, "GAME"], [169, 171, "ORG"], [197, 224, "PLAYER"], [227, 244, "PLAYER"], [250, 277, "PLAYER"], [279, 283, "PLAYER"], [303, 311, "ORG"], [351, 356, "GAME"], [413, 436, "PLAYER"], [544, 567, "PLAYER"], [652, 656, "PLAYER"], [742, 753, "TOURN"], [758, 777, "TOURN"], [812, 827, "TOURN"], [829, 837, "ORG"]]}
{"id": 277, "text": "Each group features two teams ranked around the 20th spot, with CR4ZY and North headlining Group A, while the former Tricked team, who were recently transferred to an undisclosed organization, and GODSENT are the highest-ranked teams in Group B. Barring the regular season of ESL Pro League, BIG will be playing their first full LAN tournament since late September and are filling up Group A alongside Movistar Riders, while Illuminar and Gambit Youngsters complete the other side. The group stage will be played in the typical DreamHack GSL format with best-of-ones in the upper bracket and best-of-threes in elimination and deciding matches, with the top two sides advancing to the playoffs. Group A: Europe CR4ZY Denmark North Germany BIG Spain Movistar Riders Group B: Denmark Tricked Europe GODSENT Poland Illuminar Russia Gambit Youngsters These are the opening matchups: Group A: Europe CR4ZY vs. Spain Movistar Riders Denmark North vs. Germany BIG Group B: Denmark Tricked vs. Russia Gambit Youngsters Europe GODSENT vs. Poland Illuminar DreamHack Open Sevilla will run from December 13-15, taking place at the FIBES convention center.", "meta": {}, "annotation_approver": null, "labels": [[64, 69, "ORG"], [74, 79, "ORG"], [197, 204, "ORG"], [276, 290, "TOURN"], [292, 295, "ORG"], [402, 417, "ORG"], [425, 434, "ORG"], [439, 456, "ORG"], [528, 541, "TOURN"], [710, 715, "ORG"], [724, 729, "ORG"], [738, 741, "ORG"], [748, 763, "ORG"], [781, 788, "ORG"], [796, 803, "ORG"], [811, 820, "ORG"], [835, 845, "ORG"], [894, 899, "ORG"], [910, 925, "ORG"], [934, 939, "ORG"], [952, 955, "ORG"], [973, 980, "ORG"], [992, 1009, "ORG"], [1017, 1024, "ORG"], [1036, 1045, "ORG"], [1046, 1068, "TOURN"]]}
{"id": 278, "text": "Finn \"karrigan\" Andersen's men can breathe a little easier now as they survived their notoriously slow starts this time around in Odense, dominating ATK once they warmed up to the opening match. Ricky \"floppy\" Kemery & co. caught mousesports off-guard early on with a strong defense, hardly ever letting the European side enter either of the bombsites en route to a 6-0 lead. With Özgür \"woxic\" Eker finding key openings and a triple-kill overall, the favorites woke up, and after losing a 1v1 situation to Johnny \"JT\" Theodosiou they managed to break the American-South African team's economy to take over the rest of the half, finishing it off with a one-round lead. ATK picked up the second pistol round, but their hopes were crushed when mousesports answered with a forcebuy, using the shift of momentum to rally to a quick closing to survive the initial scare at 16-9 and move on into the second round of the upper bracket in Group B.", "meta": {}, "annotation_approver": null, "labels": [[149, 152, "ORG"], [195, 216, "PLAYER"], [230, 241, "ORG"], [381, 399, "PLAYER"], [507, 529, "PLAYER"], [742, 753, "ORG"], [0, 24, "PLAYER"], [669, 672, "ORG"]]}
{"id": 279, "text": "Continuing from the previous round's theme, the third round of matches in Odense started out just as one-sided, with the newly acquired Renegades team finding themselves fighting an uphill battle on Inferno up against the No.1 team in the world, Astralis. After losing the opening pistol round, the Danish side immediately recovered with a second-round forcebuy and went on to dominate the rest of the half, only letting go of two more rounds, one of which saw Liam \"malta\" Schembri clutch a 1v3. The opening of the second half saw the pistol round replayed due to one of the new agent models being used by Grayhound, who won the replayed round nonetheless to close the gap. Astralis were left undeterred, though, pushing the last four rounds through for a 16-8 victory. The match on the B stream started off similarly and took place on the same map, Inferno, with G2 dominating the first 12 rounds on the back of an all-around great performance, particularly from Audric \"JaCkz\" Jug and Nemanja \"huNter-\" Kovač, while none of Sharks' players put up more than five kills as they started the match down 1-11. The Brazilian-Argentinian squad made a heroic effort to come back into contention with two more rounds to their name before the half ended and a great start in the second half, but G2 ultimately managed to clinch the victory when things got dangerous at 16-13, breathing a sigh of relief.", "meta": {}, "annotation_approver": null, "labels": [[136, 145, "ORG"], [246, 254, "ORG"], [461, 482, "PLAYER"], [607, 616, "ORG"], [675, 683, "ORG"], [865, 867, "ORG"], [965, 983, "PLAYER"], [988, 1011, "PLAYER"], [1289, 1291, "ORG"], [1027, 1033, "ORG"]]}
{"id": 280, "text": "The second pair of matches in Odense was headlined by a match between two top-five sides, which turned out to be a one-sided affair as Evil Geniuses made light work of fnatic on Mirage. It looked anything but a clash between teams separated by just two places in the rankings, with the North Americans racing to a 13-2 lead after a dominant CT performance, led by Tsvetelin \"CeRq\" Dimitrov, who racked up 19 frags. fnatic responded in convincing fashion with a victory in a quick pistol round, but more misery was to come for them. EG rallied back immediately on a force buy and put together a string of rounds en route to a quick finish that puts them through to move on in Group A's upper bracket. Meanwhile, 100 Thieves beat Heroic on the secondary stream on Vertigo, where they put up a masterclass of a defensive performance. After a slow start, the Danes took the reins of the game and secured the lead, but the Australians fought back and ended the half up 8-7. Now playing on the CT side, 100 Thieves kept their defense tight and compact and won seven rounds in a row to hit match point. Heroic still attempted a response, but one round was all they could muster as the former Renegades squad laid the game to rest to set up a clash against Evil Geniuses later in the day.", "meta": {}, "annotation_approver": null, "labels": [[135, 148, "ORG"], [364, 389, "PLAYER"], [415, 421, "ORG"], [532, 534, "ORG"], [711, 722, "ORG"], [728, 734, "ORG"], [997, 1008, "ORG"], [1096, 1102, "ORG"], [1185, 1194, "ORG"], [1249, 1262, "ORG"], [168, 174, "ORG"]]}
{"id": 281, "text": "Pro League action began with a mouth-watering clash between FaZe and MIBR in what was Marcelo \"coldzera\" David's first match against his old teammates after leaving the squad in the summer in a move that was heavily scrutinized in the scene. MIBR were dealt a heavy blow early on as they wasted a 5v2 situation in the pistol round but gathered themselves immediately and responded on a force buy before Nikola \"NiKo\" Kovač put his team back in the lead with a trio of kills with a saved M4. The Bosnian talent was a nuisance to MIBR and pulled off several multi-kill rounds as FaZe raced to a 6-3 lead. Things were starting to look ugly for MIBR, who were struggling to string rounds together, but they dominated proceedings in the final stages of the half to go into the break up by one round. FaZe came out the brighter of the two teams and regained the lead after a great start to the second half, but, they struggled to break through the MIBR defense once both teams had guns in hand. Gabriel \"FalleN\" Toledo showed glimpses of his old form as the Brazilians kept FaZe at bay for the remainder of the half and picked up a victory that comes as a massive confidence boost for the team. Meanwhile, Natus Vincere made light work of TYLOO on the secondary stream thanks to big performances from their star players. The Russian team got off on the wrong foot and failed to build on a pistol round victory but assembled a water-tight defense once their economy stabilized to grab a commanding 11-4 lead. The early stages of the second half were played at a frantic pace as rounds went back and forth and neither side could get a grip on the game. But there was no stopping Natus Vincere, who took the upper hand and won four rounds without response to secure a convincing victory and prove that slow starts are a thing of the past.", "meta": {}, "annotation_approver": null, "labels": [[0, 10, "TOURN"], [60, 64, "ORG"], [69, 73, "ORG"], [242, 246, "ORG"], [403, 422, "PLAYER"], [528, 532, "ORG"], [577, 581, "ORG"], [641, 645, "ORG"], [795, 799, "ORG"], [942, 946, "ORG"], [989, 1012, "PLAYER"], [1068, 1072, "ORG"], [1200, 1213, "ORG"], [1233, 1238, "ORG"], [1671, 1684, "ORG"], [86, 110, "PLAYER"], [487, 489, "AVATAR"]]}
{"id": 282, "text": "From December 3-8 a list of 16 contenders will be present in Odense, Denmark for the $600,000 ESL Pro League Finals Season 10, looking to secure their share of the sizeable prize pool. As per previous iterations of the event held in Denmark, matches return to the Jyske Bank Arena, previously known as the Sparekassen Fyn Arena. Teams have been split into two equal groups, with group stage matches featuring a GSL double-elimination format, where initial matches will see best-of-one faceoffs, followed by best-of-three decider series. Teams to top their group advance straight to the semi-finals, while runners up and third-placed teams make it to the quarter-finals as high and low seed, respectively. Playoffs will see a best-of-three, single-elimination setting, barring the grand final, which will feature a best-of-five derby. Viewers are treated to a high-profile list of teams, including home crowd favourites, Astralis, North America's Evil Geniuses and Liquid, the newly-signed Renegades roster, as well as many other squads from regions around the world. Over the coming week, HLTV.org's Josip \"brcho\" Brtan and Aleksei \"Aleksei_L\" Louchnikov will be bringing you content from Odense in the form of photography and interviews. If you need to catch up with standings in Odense, or are simply looking for the match schedule, head over to our viewer's guide for the event.", "meta": {}, "annotation_approver": null, "labels": [[94, 125, "TOURN"], [920, 928, "ORG"], [946, 959, "ORG"], [964, 970, "ORG"], [989, 998, "ORG"]]}
{"id": 283, "text": "The announcement was made in a Weibo post by OneThree co-owner JiaYi \"Jalen\" Wu, who revealed that Dosia will be the squad's in-game leader and mou the primary AWPer. OneThree have not yet announced which two Chinese players will be offloaded to make way for the new arrivals, but sources have told HLTV.org that QiFang \"Karsa\" Su and Yue \"AE\" Yu are the likeliest to get the chop. Dosia and mou join OneThree on free transfers after being released by Gambit on Monday. The pair spent over three years with the CIS organisation, winning several international tournaments, most notably the 2017 Major hosted by PGL in Kraków. With these two additions, OneThree now have: China Ke \"captainMo\" Liu, China Hui \"DD\" Wu, China QiFang \"Karsa\" Su, China Yue \"AE\" Yu, China Liu \"lan\" Qi, Russia Mihail \"Dosia\" Stolyarov, Kazakhstan Rustem \"mou\" Telepov", "meta": {}, "annotation_approver": null, "labels": [[45, 53, "ORG"], [99, 104, "PLAYER"], [167, 175, "ORG"], [313, 330, "PLAYER"], [335, 346, "PLAYER"], [382, 387, "PLAYER"], [144, 147, "PLAYER"], [392, 395, "PLAYER"], [401, 409, "ORG"], [452, 458, "ORG"], [651, 659, "ORG"], [676, 694, "PLAYER"], [702, 713, "PLAYER"], [721, 738, "PLAYER"], [746, 757, "PLAYER"], [765, 777, "PLAYER"], [786, 810, "PLAYER"], [823, 843, "PLAYER"]]}
{"id": 284, "text": "The Australian team inked a deal with Renegades ahead of the ESL Pro League Season 10 Finals and will have a baptism of fire under the new organisation as they will take on Astralis in their first match in Odense on Tuesday. Renegades had been without a CS squad since late October, when their team was transferred to 100 Thieves. During their four-year tenure with the organisation, the squad, who also hail from Australia, had attended five Counter-Strike Majors, reaching the playoffs at IEM Katowice 2019 and at the StarLadder Major. Grayhound entered the Counter-Strike scene with the signing of the ex-Immunity roster in June of 2017, three months after the launch of the organisation. After undergoing multiple changes, the team became a regular presence on the international circuit in 2018 and attended both Majors in 2019, when they also broke into the top 20 in the rankings. In the announcement video, Liam \"malta\" Schembri hinted at the team staying in Australia through a phone call skit with Renegades owner Jonas Jerebko. The new Renegades squad look as follows: Australia Liam \"malta\" Schembri Australia Ollie \"DickStacy\" Tierney Australia Christopher \"dexter\" Nong New Zealand Simon \"Sico\" Williams Australia Joshua \"INS\" Potter", "meta": {}, "annotation_approver": null, "labels": [[38, 47, "ORG"], [57, 92, "TOURN"], [225, 234, "ORG"], [318, 329, "ORG"], [443, 457, "GAME"], [491, 508, "TOURN"], [516, 536, "TOURN"], [538, 547, "ORG"], [560, 574, "GAME"], [914, 935, "PLAYER"], [1007, 1016, "ORG"], [1046, 1055, "ORG"], [1089, 1110, "PLAYER"], [1121, 1146, "PLAYER"], [1157, 1182, "PLAYER"], [1195, 1216, "PLAYER"], [1227, 1246, "PLAYER"]]}
{"id": 285, "text": "November brought a large variety of LAN tournaments, from the regional eXTREMESLAND Asia Finals to the middle-of-the-field DreamHack Open stops in Atlanta and Jönköping, all the way up to the biggest events of the month in IEM Beijing and ECS Season 8 Finals, where teams tend to make the most headway in the rankings. The top end largely remains similar from October, with the top-four teams shifting a spot upward or downward, as Astralis reclaimed their crown from Evil Geniuses on the back of their IEM Beijing win, while 100 Thieves have entered the top-five thanks to a runners-up finish at the Chinese tournament. Further down, TYLOO, GODSENT, and Spirit have made big strides, jumping into the top 30. Below is the current top 30 table as of November 4th, 2019, which goes more in-depth into how the points are distributed—or you can check our special page, where you will be able to find the latest, weekly version of our ranking. You can see the lineup for each team by hovering over their name in the table. After a brief period at the end of October that saw Astralis fail to win a title three events in a row and concede the No.1 spot to Evil Geniuses, the Danes returned to reclaim the throne as they went back to winning ways at IEM Beijing. In China, they looked as amazing as ever with one of the most dominant runs we have ever seen and secured the No. 1 spot again on the following Monday. As the month came to a close, Lukas \"gla1ve\" Rossander's squad traveled to the other side of the globe to the ECS Season 8 Finals and added another trophy to their cabinet (when it gets out of customs, anyway), defeating all of the other top-four teams in the process in fnatic, Evil Geniuses and Liquid, to solidify their spot at the top and maximize their points at 1,000 — an amount they had not had for over six months (April 29). 100 Thieves had already shown improvements before their move to the North American organization, culminating their time with Renegades with top fours at the StarLadder Major and StarSeries i-League Season 8 in October, but the team was still missing a grand final appearance at a big event. Aaron \"AZR\" Ward's men crossed that bridge immediately after siding with Matthew \"Nadeshot\" Haag's organization at the beginning of the month. Making it to the final at IEM Beijing with wins over ENCE and Vitality before the behemoth of Astralis stopped them at the last hurdle, 100 Thieves earned a place in the top five for the first time since early April. On the other hand, ENCE's rut dating back to the addition of Miikka \"suNny\" Kemppi in September carried over into November, as despite an entire month's worth of preparation the Finns couldn't make it past the Australian squad on two separate occasions and barely beat ViCi in Beijing, suggesting they still had ways to go before their new lineup could reach the former's glory. The CS:GO Asia Championships, two weeks later, marked an important milestone in the ENCE camp, however, as they won their first series against top-20 teams, beating mousesports and MIBR en route to their first appearances in playoffs and a grand final, in which they ended up falling at the hands of Finn \"karrigan\" Andersen's side in the rematch to conclude the Chinese event in second place. Having dropped out of the top-ten in October, the Finnish squad are on the way to recovery at No.10. Although very impressive, GODSENT's jump from 31st to 21st place was not enough to claim the EPC Shooting Stars prize because TYLOO outdid them with a 15-spot climb to the 20th place as the most-improved team of November, winning a seven-day bootcamp for six people at the Kinguin Esports Performance Center in Warsaw, Poland. The Chinese side had been struggling to make their mark, a trend that continued during the first week of November, when Hansel \"BnTeT\" Ferdinand & co. couldn't challenge Vitality or Evil Geniuses at IEM Beijing. However, later in the month they enjoyed success with a regional win at eXTREMESLAND Asia Finals and, more importantly, an impressive run at CS:GO Asia Championships, where TYLOO barely missed out on the grand final due to a huge comeback from mousesports after taking down G2 and MIBR.", "meta": {}, "annotation_approver": null, "labels": [[71, 95, "TOURN"], [123, 137, "TOURN"], [223, 234, "TOURN"], [239, 258, "TOURN"], [432, 440, "ORG"], [468, 481, "ORG"], [503, 514, "TOURN"], [526, 537, "ORG"], [635, 640, "ORG"], [642, 649, "ORG"], [655, 661, "ORG"], [1071, 1079, "ORG"], [1151, 1164, "ORG"], [1244, 1255, "TOURN"], [1439, 1465, "PLAYER"], [1515, 1538, "TOURN"], [1680, 1686, "ORG"], [1688, 1701, "ORG"], [1706, 1712, "ORG"], [1844, 1855, "ORG"], [1969, 1978, "ORG"], [1997, 2017, "TOURN"], [2022, 2050, "TOURN"], [2135, 2153, "PLAYER"], [2208, 2233, "PLAYER"], [2304, 2315, "TOURN"], [2331, 2335, "ORG"], [2340, 2348, "ORG"], [2372, 2380, "ORG"], [2414, 2425, "ORG"], [2514, 2520, "ORG"], [2556, 2577, "PLAYER"], [2764, 2768, "ORG"], [2878, 2902, "TOURN"], [2958, 2962, "ORG"], [3055, 3059, "ORG"], [3039, 3050, "ORG"], [3174, 3200, "PLAYER"], [3395, 3404, "ORG"], [3495, 3500, "ORG"], [3816, 3840, "PLAYER"], [3866, 3874, "ORG"], [3878, 3891, "ORG"], [3895, 3906, "TOURN"], [3980, 4004, "TOURN"], [4049, 4073, "TOURN"], [4081, 4086, "ORG"], [4152, 4163, "ORG"], [4182, 4184, "ORG"], [4189, 4193, "ORG"]]}
{"id": 286, "text": "The duo had been on Gambit's ranks since the organisation ventured into Counter-Strike, in January of 2016, and were part of the team that won PGL Major Kraków in 2017 under the leadership of Danylo \"Zeus\" Teslenko. Both players spent the last six months on the bench as Gambit decided to put their primary line-up on hold following a period of roster instability and poor results. At the same time, the organisation switched their focus to their academy squad, called Gambit Youngsters, who broke into the top 30 in the rankings for the first time last month. The announcement comes days after a report from DBLTAP linked Dosia and mou with a move to China to play under OneThree. HLTV.org has learned that the CIS pair are already at the Chinese team's gaming house, located in Shanghai, and that OneThree are testing multiple options to find the right composition. It is currently unclear whether the ex-Gambit players will take part in the WESG Greater China Finals, which will be held from December 12-15 in Suzhou.", "meta": {}, "annotation_approver": null, "labels": [[20, 28, "ORG"], [72, 86, "GAME"], [143, 159, "TOURN"], [192, 214, "PLAYER"], [271, 277, "ORG"], [469, 486, "ORG"], [623, 628, "PLAYER"], [633, 636, "PLAYER"], [672, 680, "ORG"], [799, 807, "ORG"], [944, 969, "TOURN"]]}
{"id": 251, "text": "The second Major of the 2019-20 Dota Pro Circuit is filling out its roster with some of the best Dota 2 teams in the world. But there are also several upsets that have already happened, leading to a few surprise entries and exclusions.\nThe main qualifiers will run through Dec. 4 before 15 teams will be officially locked in for DreamLeague Season 13. The remaining teams that fell just short of the Major will prepare for a run at the Minor.\nFor the second Major, there are three spots for Europe, China, and Southeast Asia, while CIS, North America, and South America all get two. That means the EU region is gaining a spot while NA loses one.\nHere are all the teams who have qualified for DreamLeague Season 13.\nSo far, the standouts have been IG and Liquid. Both teams dominated their respective regions. IG continue to look like one of the best teams in the world after winning the Dota Summit 11 Minor and then finishing third at the MDL Chengdu Major last month. The Chinese squad also beat Vici, the team that bested them at the last Major to secure the top seed for the region. \nLiquid swept through the group stage of the EU qualifiers, including an impressive 2-0 win over the organization’s former roster that makes up the Nigma stack. The entire run was capped by another 2-0 over Alliance, completing a perfect 10-0 record and grabbing the first spot at the Major for arguably the toughest region. \nTNC, the top team in the world, struggled early in the SEA qualifiers and couldn’t quite make up the ground necessary to claim the top seed for a second straight Major. Instead, the team had to settle for the third invite after losing to Fnatic and watching the Reality stack come from nowhere to storm the DPC. \nThe final spot for DreamLeague Season 13 will go to the team that manages to climb out of the WePlay! Bukovel Minor with a victory. The second Major of the season will begin on Jan. 18, with that final team being announced on Jan. 12.", "meta": {}, "annotation_approver": null, "labels": [[97, 103, "GAME"], [329, 350, "TOURN"], [692, 713, "TOURN"], [747, 749, "ORG"], [754, 760, "ORG"], [809, 811, "ORG"], [940, 957, "TOURN"], [887, 908, "TOURN"], [998, 1002, "ORG"], [1088, 1094, "ORG"], [1413, 1416, "ORG"], [1651, 1657, "ORG"], [1671, 1688, "ORG"], [1745, 1766, "TOURN"], [1820, 1841, "TOURN"], [32, 36, "GAME"]]}
{"id": 252, "text": "While other regions saw upsets and surprising Dota 2 teams rising through the ranks, Europe had two juggernauts returning to the game for the first time this season. And they both looked ready to continue their dominant performance from the past. \nThe former Team Liquid roster led by Kuro \"KuroKy\" Takhasomi and Clement “Puppey” Ivanov’s Team Secret wasted no time asserting themselves over the rest of the competition. They each blew through the open qualifiers for the DreamLeague Season 13 Major today.\nNigma, the stack Kuro formed with his teammates after they left Liquid, played a total of four games in the open qualifiers. But none of them lasted longer than 22 minutes. The runners-up from The International 2019 put on a clinic, taking out their first opponent in a 21-minute blowout before following that up by clearing the next round in just over 11 minutes. \nThe only real test for the new organization came against OG Seed, a group of veteran players brought in by OG to play as a secondary roster. But even that elevated level of competition only slightly slowed down Nigma. Kuro and his team demonstrated just how deep and versatile their draft game is.\nIn two sub 30-minute games, Nigma claimed the first ticket to the closed Major qualifiers, leaving OG without any representation for a second straight set of Dota Pro Circuit events.\nOn the other side of the bracket, Secret had no trouble reaching the final round of the event. But their opponents were an odd stack of talented CIS players who gave them a good run at the last minute. The combined play of Jonáš \"SabeRLight-\" Volek, Milan \"MiLAN\" Kozomara, and Akbar \"SoNNeikO\" Butaev was almost enough to steal a game off of Secret, but Puppey and crew somehow managed to pull back into the lead to close out both games.\nGame one was built on strange interactions and minimal kills, but the Chicken Fighters stack took advantage of that early to build a solid lead. Puppey and the team's newest addition, Lasse \"MATUMBAMAN\" Urpalainen, went untouched during the tough mid-game, which allowed them to carry their team to a late comeback.\nThat showing was replicated again in game two after soNNeikO and his team managed to snuff out a big Secret lead at the 20-minute mark and forced one of the EU’s top teams into another tight fight. Matu and Puppey closed out the game again with a lot of help from an expertly played Viper by Michał \"Nisha\" Jankowski, who made up for a poor performance from Ludwig \"zai\" Wåhlberg.\nBoth teams are now locked into the closed qualifiers and will have a chance at making it to the DreamLeague Season 13 Major. If they fail to beat some of the other top European teams waiting for them, there are three spots for the WePlay! Bukovel Minor EU qualifiers available, too.\nCompetition for those spots begins on Dec. 1 after all of the other open qualifiers wrap up.", "meta": {}, "annotation_approver": null, "labels": [[46, 52, "GAME"], [285, 308, "PLAYER"], [339, 350, "ORG"], [259, 270, "ORG"], [472, 499, "TOURN"], [507, 512, "ORG"], [524, 528, "PLAYER"], [571, 577, "ORG"], [700, 722, "TOURN"], [930, 937, "ORG"], [980, 982, "ORG"], [1084, 1089, "ORG"], [1091, 1095, "PLAYER"], [1199, 1204, "ORG"], [1270, 1272, "ORG"], [1388, 1394, "ORG"], [1577, 1602, "PLAYER"], [1604, 1626, "PLAYER"], [1632, 1655, "PLAYER"], [1697, 1703, "ORG"], [1709, 1715, "PLAYER"], [1863, 1879, "ORG"], [1938, 1944, "PLAYER"], [1977, 2006, "PLAYER"], [2161, 2169, "PLAYER"], [2210, 2216, "ORG"], [2307, 2311, "PLAYER"], [2316, 2322, "PLAYER"], [2401, 2425, "PLAYER"], [2467, 2488, "PLAYER"], [2586, 2613, "TOURN"], [2721, 2742, "TOURN"], [2392, 2397, "AVATAR"], [313, 336, "PLAYER"]]}
{"id": 253, "text": "The top Chinese team from The International 2019, PSG.LGD, skipped out on competing in the first set of DPC qualifiers to give its players a longer break, but it seems it might have been a mistake.\nThe team was upset by FTD.apollo in the round of 16 of the second qualifier for the DreamLeague Season 13 Major. That means there are no do-overs and LGD won’t be at the tournament. The team will now have to wait two full months before they can compete in the open qualifiers for the next Major, the ESL One Los Angeles tournament.\nSince the changes Valve made to the qualifiers for the 2019-20 Dota Pro Circuit season, no matter how good a team is, they have to compete in the open qualifiers if they don’t have any DPC points.\nThat’s a very heavy burden for even the best teams. All it takes is one game for a team to get hot enough to actually break out and take out one of the top rosters in the world, which is what PSG.LGD just fell victim to.\nThere isn’t a lot of information out there about FTD.apollo, which is a new subsidiary team of For The Dream. But the team managed to get hot at the perfect time to eliminate one of the incoming favorites before they even made it to closed qualifiers.\nHowever, LGD isn’t the only top team to suffer this big of a loss. Keen Gaming, another organization that was represented at TI9, was defeated in the same round by their sub-team KG.Luminous, which is going to prompt several roster changes. Another notable losses also show Team Serenity falling in the round of 16 and Team Sirius losing in the round of 32.\nThis loss caught a lot of the Dota 2 community off-guard since a team that played so well at TI was felled by a roster we have little to no information on. Even a few changes shouldn’t have led to something like this happening, but that is the gamble teams take when they skip out on the opening qualifiers.\nVirtus.pro is a perfect example of this. After bowing out of the Dota Summit 11 Major, they were still able to maintain a guaranteed spot in the closed qualifiers for DreamLeague Season 13 because they still had 20 DPC points under their name for making it that far.\nThis was LGD’s first competitive event since TI9, so it is unlikely any major shifts will take place. This round of qualifiers took place two days after the release of one of the biggest recent Dota 2 patches, so this may have influenced the final result as well.", "meta": {}, "annotation_approver": null, "labels": [[26, 48, "TOURN"], [50, 57, "ORG"], [220, 230, "ORG"], [282, 309, "TOURN"], [348, 351, "ORG"], [498, 528, "TOURN"], [919, 926, "ORG"], [997, 1007, "ORG"], [1043, 1056, "ORG"], [1209, 1212, "ORG"], [1267, 1278, "ORG"], [1325, 1328, "TOURN"], [1379, 1390, "ORG"], [1474, 1487, "ORG"], [1519, 1530, "ORG"], [1588, 1594, "GAME"], [1651, 1653, "TOURN"], [1931, 1951, "TOURN"], [1866, 1876, "ORG"], [2033, 2054, "TOURN"], [2142, 2145, "ORG"], [2178, 2181, "TOURN"], [2327, 2333, "GAME"], [593, 597, "GAME"]]}
{"id": 254, "text": "Qualifiers for the second Dota Pro Circuit Major are fast approaching and several teams that took extended breaks following The International 2019 are set to make their season debut.\nBut in a pair of videos that imply several changes coming to the OG organization, fans learned today is that the reigning Dota 2 world champions won’t be competing in the second Major of the season—at least not with their current roster.\nInstead of bringing back the main five-man squad that won back-to-back Internationals, five new players of various backgrounds will represent OG and compete for a spot at the second Major through the European qualifiers. Johan \"N0tail\" Sundstein will take over the role of coach for this new team that will temporarily play under the OG banner.\n\"For the second Major, me and the boys won’t be attending, but don’t worry, we will still be going for that third title,\" N0tail said. \"In the meantime, we have decided to jump on another exciting project and we have gathered this group of players that, in our mind, have huge potential.\"\nThis new roster known as OG Seed will function as an extension of the main OG roster, much like how PSG.LGD has a competitive secondary lineup in LGD.CDEC.\nChessie and Zfreek are savvy veterans who spent the majority of their careers with Complexity in North America. Meanwhile, the remaining three players are all talented competitors who just haven’t found the right stack yet.", "meta": {}, "annotation_approver": null, "labels": [[124, 146, "TOURN"], [248, 250, "ORG"], [305, 311, "GAME"], [563, 565, "ORG"], [642, 666, "PLAYER"], [755, 757, "ORG"], [888, 894, "PLAYER"], [1080, 1087, "ORG"], [1130, 1132, "ORG"], [1155, 1162, "ORG"], [1201, 1209, "ORG"], [1211, 1218, "PLAYER"], [1223, 1229, "PLAYER"], [1294, 1304, "ORG"], [26, 30, "GAME"]]}
{"id": 255, "text": "Kuro \"KuroKy\" Takhasomi and the rest of the Team Liquid Dota 2 roster departed from the organization just days after finishing second at The International 2019, and now we know their plans.\nThe squad has formed their own, independent organization, Nigma. Each of the players teased the announcement on Nov. 24, more than 24 hours before they revealed the team.\nNo changes were made to the TI9 roster that challenged OG in the grand finals, which means Nigma will likely be one of the strongest teams at the DreamLeague Season 13 qualifiers.\nWe knew based on Kuro’s comments following the split from Liquid that he and team manager Mohamed \"almany-\" Morad wanted to strike out on their own, away from bigger organizations. This is the first step for the roster that won TI7 (plus Aliwi \"w33\" Omar) to control every aspect of their competitive destiny.\nWe can only assume that the team will continue competing in the European region after seeing so much success, but there was no confirmation of that choice shown in the video. In fact, all we know is the new name that chats are going to be spamming as a joke for the foreseeable future.\nMore information will likely come out in the following days, but for now, expect that Nigma will be back to a top spot in whatever region they play in within the next few months.", "meta": {}, "annotation_approver": null, "labels": [[0, 23, "PLAYER"], [44, 55, "ORG"], [56, 62, "GAME"], [137, 159, "TOURN"], [248, 253, "ORG"], [389, 392, "TOURN"], [416, 418, "ORG"], [452, 457, "ORG"], [507, 528, "TOURN"], [599, 605, "ORG"], [779, 795, "PLAYER"], [1223, 1228, "ORG"], [769, 772, "TOURN"], [558, 562, "PLAYER"]]}
{"id": 256, "text": "Instead of taking a full break from competitive play after departing from Team Secret, Yeik \"MidOne\" Nai Zheng is heading back to Southeast Asia and teaming up with some of his free agent friends to form a new stack.\nSEAMonkeys features the former Secret player and ex-Mineski captain Michael \"ninjaboogie\" Ross Jr. Both players didn’t compete in the first qualifying event for the Dota Pro Circuit, but now they’ll join forces again to make a run at a spot for DreamLeague Season 13.\nIt’s unknown exactly which players will play what position, but in MidOne’s announcement post, this is the order they were listed in.\nThis stack is made up of two top-tier Dota 2 players and three SEA players that they either knew or have enough experience to be competent playing in high-pressure scenarios. Namely, Zeal is the current captain of Dota Hero, a tier-two Malaysian team that’s had decent results throughout 2019.\nHe brought along his position two teammate Chidori~, who will now run alongside MidOne when they attempt to secure a spot in one of the upcoming DPC events.\nKennyO is the final player joining the squad. He’s an unknown player who’s being described as \"MidOne’s friend\" in the discussion threads on Reddit, which goes right along with him saying that he’s playing for fun in this qualifier and is treating it as part of his break.\nThe next wave of DPC qualifiers begin on Dec. 1, so this team will be facing off against T1 and several other new SEA rosters in just under a week.", "meta": {}, "annotation_approver": null, "labels": [[74, 85, "ORG"], [87, 110, "PLAYER"], [217, 227, "ORG"], [248, 254, "ORG"], [266, 276, "ORG"], [285, 314, "PLAYER"], [382, 386, "GAME"], [462, 483, "TOURN"], [657, 663, "GAME"], [802, 806, "PLAYER"], [833, 842, "ORG"], [956, 964, "PLAYER"], [993, 999, "PLAYER"], [1070, 1076, "PLAYER"], [1432, 1434, "ORG"], [552, 558, "PLAYER"], [1165, 1171, "PLAYER"]]}
{"id": 257, "text": "TNC Predator have done it. For two times in a row, they took down Chinese teams in front of their home crowds and won an international Dota 2 LAN tournament. With today’s win at the MDL Chengdu Major, they’ve put themselves in pole position in the 2019-2020 Dota Pro Circuit and have all but guaranteed their attendance at The International 2020.\nTNC matched up against crowd favorites Vici Gaming in the grand final of the MDL Chengdu Major. The SEA squad emerged victorious with a 3-1 series and was the more convincing and consistent team throughout.\nThe first two games contained masterclass performances from TNC and their two core players, Kim \"Gabbi\" Villafuerte and Armel Paul Tabios. The two Filipino players put their skill and versatility on display. The first game was the Armel show on Outworld Devourer, while Gabbi created space with his Chaos Knight.\nThe second game was a classic Morphling performance by Gabbi, along with his trusty partner Earthshaker, and an atypical Armel Viper that served mostly as a counter pick to VG’s Phantom Assassin. In both games, TNC worked in tandem, putting on mesmerizing performances that sent them to an early 2-0 lead against the Chinese favorites.\nIn the third game, TNC placed their faith in yet another cheesy combo, Chen and Alchemist, while VG drafted a different flavor in Keeper of the Light and Night Stalker. For the first time in the series, it was VG that raced out to a hot start, making rapid rotations around the map with the power of the mobile Pangolier and long-range initiation of Kunkka. Finally, it looked like the Chinese giants have awoken from their slumber, preventing a clean sweep and sending the series to a fourth game.\nThe fourth match would prove to be the only close game of the series, a back-and-forth struggle from which TNC prevailed. TNC’s captain Park \"March\" Tae-won placed his faith in Morphling and Earthshaker once again for all the marbles, while Vici believed in high-voltage cores Templar Assassin and Leshrac.\nTNC raced out to an early kill lead, but VG were able to stabilize the game off the back of their dynamic duo. Zeng \"Ori\" Jiaoyang’s Templar was an instrumental part of the team’s mid-game success, assassinating TNC’s backline and securing multiple Roshans for the team.\nYet, they were all too wary of the ticking time bomb on TNC’s side and tried their hardest to take down Gabbi’s Morphling. They were successful a few times, but it was to little avail.\nWhile Gabbi was undoubtedly the lead actor with his flashy Morphling plays, each TNC player played their part in the ensemble cast. Multiple key pick-offs were set up by the Naga’s Song of the Siren into Disruptor’s upgraded Static Storm, leaving the trapped cores hapless and easily slaughtered by Gabbi.\nEarthshaker and Morphling were definitely powerful, but it would be a discredit to how well TNC played to bring it back from the brink. Gabbi toed the line between offense and over-aggression near perfectly and fully deserved his MVP award, while Armel played his role as a damage sponge, diving headfirst into VG to allow his team more room to breathe.\nThe best part about TNC’s victory was how unapologetically TNC they were. For much of the tournament, teams were desperately trying to copy their style, even in this very series. They established much of this tournament’s meta with picks such as Night Stalker carry, the Morphling and Earthshaker combo, Venomancer offlane, and Disruptor as a counter to highly-mobile lineups. They barely touched Gyrcopter and Faceless Void, two of the most commonly picked up carry heroes in the game and were confident in their approach.\nAs OG and so many other teams proved at TI9, having fun and playing your personal brand of Dota is the way to win. Evidently, TNC were not afraid to do so and have now been rewarded with two straight championships in ESL One Hamburg and the MDL Chengdu Major.", "meta": {}, "annotation_approver": null, "labels": [[0, 12, "ORG"], [182, 199, "TOURN"], [258, 262, "GAME"], [347, 350, "ORG"], [386, 397, "ORG"], [424, 441, "TOURN"], [614, 617, "ORG"], [646, 669, "PLAYER"], [674, 691, "PLAYER"], [988, 993, "PLAYER"], [922, 927, "PLAYER"], [824, 829, "PLAYER"], [1040, 1044, "ORG"], [1078, 1081, "ORG"], [1222, 1225, "ORG"], [1300, 1302, "ORG"], [1413, 1415, "ORG"], [1838, 1858, "PLAYER"], [1809, 1812, "ORG"], [1824, 1829, "ORG"], [1943, 1947, "ORG"], [2050, 2052, "ORG"], [2009, 2012, "ORG"], [2120, 2141, "PLAYER"], [2221, 2226, "ORG"], [2336, 2341, "ORG"], [2384, 2391, "PLAYER"], [2471, 2476, "PLAYER"], [2546, 2549, "ORG"], [2764, 2769, "PLAYER"], [2863, 2866, "ORG"], [2907, 2912, "PLAYER"], [3018, 3023, "PLAYER"], [3082, 3084, "ORG"], [3145, 3150, "ORG"], [3184, 3187, "ORG"], [3652, 3654, "ORG"], [3689, 3692, "TOURN"], [3740, 3744, "GAME"], [3775, 3778, "ORG"], [3866, 3881, "TOURN"], [135, 141, "GAME"], [323, 345, "TOURN"], [785, 790, "PLAYER"], [799, 816, "AVATAR"], [853, 865, "AVATAR"], [897, 906, "AVATAR"], [959, 970, "AVATAR"], [994, 999, "AVATAR"], [1045, 1061, "AVATAR"], [1274, 1278, "AVATAR"], [1283, 1292, "AVATAR"], [1333, 1352, "AVATAR"], [1357, 1370, "AVATAR"], [1514, 1523, "AVATAR"], [1553, 1559, "AVATAR"], [1879, 1888, "AVATAR"], [1893, 1904, "AVATAR"], [1979, 1995, "AVATAR"], [2000, 2007, "AVATAR"], [2142, 2149, "AVATAR"], [2258, 2265, "AVATAR"], [2392, 2401, "AVATAR"], [2524, 2533, "AVATAR"], [2669, 2680, "AVATAR"], [2639, 2645, "AVATAR"], [2771, 2782, "AVATAR"], [2787, 2796, "AVATAR"], [3371, 3384, "AVATAR"], [3396, 3405, "AVATAR"], [3410, 3421, "AVATAR"], [3429, 3439, "AVATAR"], [3453, 3462, "AVATAR"], [3522, 3531, "AVATAR"], [3536, 3549, "AVATAR"], [3890, 3907, "TOURN"]]}
{"id": 258, "text": "TNC Predator took apart Invictus Gaming in the lower bracket final of the MDL Chengdu Major 2-0. TNC were on fire, swiftly disposing of the surging IG squad to set up a second date with Vici Gaming in the grand final.\nBoth games were lopsided affairs in TNC’s favor. They relied on their trusty Morphling-Earthshaker combo again, snapping it up in the first two picks of their draft. Unlike yesterday’s series against Vici Gaming, they augmented the combo with hero picks that dominated lanes, allowing for a smoother and easier transition for Kim \"Gabbi” Villafuerte’s Morph into the endgame.\nThe second game was much of the same story, but it was Armel Paul Tabios that did the heavy lifting. While Gabbi’s Bristleback created chaos on the battlefield, Armel handled the more late-game oriented Outworld Devourer and eventually wreaked havoc on the IG squad.\nIG showed a few signs of life throughout the series, but they were quickly snuffed out by TNC’s rock-solid gameplay. The Chinese squad could not find any significant cracks in TNC’s armor and conceded twice in barely over an hour of gameplay.\nArmel, as usual, was excellent in both games. He played a high-octane playmaker Puck in the first game, followed by a farming carry in Outworld Devourer in the second, showing off his style and versatility. \nAnother significant difference maker was Damien \"kpii\" Chok. Kpii was left to the wolves in previous series, but a little support went a long way in ensuring that he had two fine games today.\nAfter yesterday’s disappointing results, TNC drafted significantly better this series. Now, they will have a chance to avenge their discombobulated showing against VG, this time in a best-of-five series in the grand final of the MDL Chengdu Major.", "meta": {}, "annotation_approver": null, "labels": [[0, 12, "ORG"], [24, 39, "ORG"], [74, 91, "TOURN"], [97, 100, "ORG"], [148, 150, "ORG"], [186, 197, "ORG"], [254, 259, "ORG"], [418, 429, "ORG"], [544, 569, "PLAYER"], [649, 666, "PLAYER"], [701, 708, "PLAYER"], [755, 760, "PLAYER"], [851, 853, "ORG"], [861, 863, "ORG"], [951, 956, "ORG"], [1037, 1042, "ORG"], [1104, 1109, "PLAYER"], [1353, 1371, "PLAYER"], [1373, 1377, "PLAYER"], [1545, 1548, "ORG"], [1668, 1670, "ORG"], [1729, 1750, "TOURN"], [295, 316, "AVATAR"], [797, 814, "AVATAR"], [570, 575, "AVATAR"], [709, 720, "AVATAR"], [1184, 1188, "AVATAR"], [1239, 1256, "AVATAR"]]}
{"id": 259, "text": "IG’s miraculous run is finally over, however. they cannot be too hard-pressed about their final result. The Chinese team has clearly punched above their weight, securing themselves a hefty cash prize of $110,000 along with their Dota Summit 11 Minor winnings of $72,000, and guaranteeing themselves 2100 Dota Pro Circuit points. Based on last year’s DPC standings, IG would comfortably make it to The International based off this single result.\nThe Chinese squad was an unexpected revelation throughout the tournament. In the beginning, Zhou \"Emo\" Yi was the jewel of the squad. The daredevil dived into his opponents repeatedly and made Houdini escapes more often than not. Emo is one of the youngest players in the Chinese scene, and more experience will undoubtedly temper and cut him into a brilliant gem.\nAs the tournament wore on, the rest of the IG roster added their own brilliant plays to the list. Thiay \"JT-\" Jun Wen had several solid performances on Kunkka and Legion Commander, transforming the utility cores into playmaking machines.\nTNC will face VG again, having previously lost 2-0 in the upper bracket final. The Southeast Asian squad looks more prepared today and will likely put up a better showing against the might of VG. Regardless of result, both teams are guaranteed at least $160,000 and 3000 DPC points, and the winner will walk away with $300,000 and 4850 DPC points.", "meta": {}, "annotation_approver": null, "labels": [[0, 4, "ORG"], [229, 249, "TOURN"], [304, 308, "GAME"], [365, 367, "ORG"], [397, 414, "TOURN"], [537, 550, "PLAYER"], [675, 678, "PLAYER"], [853, 855, "ORG"], [908, 927, "PLAYER"], [1048, 1051, "ORG"], [1062, 1064, "ORG"], [1240, 1242, "ORG"], [962, 968, "AVATAR"], [973, 989, "AVATAR"]]}
{"id": 260, "text": "The series between Invictus Gaming and Evil Geniuses at the MDL Chengdu Major saw three stomps played in a row. IG came out on top in two, guaranteeing themselves a podium finish at their first Dota 2 Major.\nThe two teams previously matched up in the first round of the upper bracket, with EG sweeping the series 2-0. The North American squad even broke IG’s 10-game winning streak and sent them into the lower bracket. In the rematch, however, IG came out on top.\nThe first two games were one-sided affairs for IG and EG respectively. For the first game, EG’s Night Stalker carry gambit was punished with a brilliant Disruptor display from Chan \"Oli\" Chon Kien. Coupled with overwhelming magic damage from Gyrocopter and Zeus, EG conceded quickly.\nThe second game dragged on longer, but the result was rarely in doubt. EG had firm control of the game, and Abed Yusop’s Ember Spirit was on fire. IG tried to counter EG’s elusive lineup with a Naga Siren and Disruptor combo, but it was too little, too late.\nFor the third game, IG went for two highly aggressive cores, putting Zhou \"Emo\" Yi on Storm Spirit and Jin \"flyfly\"‘ Zhiyi on Monkey King. EG went for a slower-paced draft, picking Outworld Devourer for Abed, supplementing it with an early game tank in the Bristleback for Artour \"Arteezy\" Babaev.\nThe game was relatively even, but the turning point was when EG’s ancient stacks were contested smartly by the Chinese squad. IG stole several creeps from the EG side and was prepared to make a clean escape before EG tried to take revenge. Unfortunately for EG, IG swiftly turned with their massive area control spells, gaining a sizeable advantage.\nWhile this game was no less of a trampling compared to the first two, IG’s style and poise were evident. The team played with a proper sense of urgency and made intelligent rotations to catch out EG’s cores.\nA big difference-maker was flyfly’s play. IG’s carry is playing like a man possessed, putting in a brilliant shift on the Monkey King, his first of the tournament. IG’s main talking points have been their hawkish mid laner Emo and stalwart off laner Thiay \"JT-\" Jun Wen, who have put in commendable playmaking performances throughout the tournament. Meanwhile, flyfly has been relatively unreliable but has come alive on the main stage.\nThe Chinese carry was a constant thorn in EG’s side, hounding EG’s cores and leaving no breathing space for them. While Emo had a characteristically aggressive game with several over-extensions, flyfly’s play was more measured, yet still in tandem with IG’s fanatical assaults. Should flyfly continue his streak of impressive play, it’s looking all the more likely for two Chinese teams to be battling it out on home soil for the trophy.", "meta": {}, "annotation_approver": null, "labels": [[19, 34, "ORG"], [39, 52, "ORG"], [112, 114, "ORG"], [194, 200, "GAME"], [290, 292, "ORG"], [354, 358, "ORG"], [445, 447, "ORG"], [512, 514, "ORG"], [519, 521, "ORG"], [556, 560, "ORG"], [641, 661, "PLAYER"], [728, 730, "ORG"], [820, 822, "ORG"], [896, 898, "ORG"], [916, 920, "ORG"], [1028, 1030, "ORG"], [1077, 1091, "PLAYER"], [1111, 1130, "PLAYER"], [1147, 1149, "ORG"], [1211, 1215, "PLAYER"], [1281, 1304, "PLAYER"], [1432, 1434, "ORG"], [1465, 1467, "ORG"], [1520, 1522, "ORG"], [1564, 1566, "ORG"], [1568, 1570, "ORG"], [2087, 2090, "PLAYER"], [2114, 2133, "PLAYER"], [2225, 2231, "PLAYER"], [2421, 2424, "PLAYER"], [2586, 2592, "PLAYER"], [60, 77, "TOURN"], [561, 574, "AVATAR"], [618, 627, "AVATAR"], [707, 717, "AVATAR"], [722, 726, "AVATAR"], [857, 867, "PLAYER"], [870, 882, "AVATAR"], [943, 953, "AVATAR"], [958, 967, "AVATAR"], [1094, 1106, "AVATAR"], [1134, 1145, "AVATAR"], [1189, 1206, "AVATAR"], [1726, 1728, "ORG"], [1906, 1908, "ORG"], [1367, 1369, "ORG"], [1852, 1854, "ORG"], [2028, 2030, "ORG"], [1986, 1997, "AVATAR"], [1891, 1897, "PLAYER"], [2496, 2502, "PLAYER"], [2343, 2345, "ORG"], [2363, 2365, "ORG"], [2554, 2556, "ORG"]]}
{"id": 261, "text": "It hasn’t been the easiest of roads for Invictus Gaming. The Chinese Dota 2 team fell in the qualifiers for the MDL Chengdu Major and had to take the hard route here by winning the Dota Summit 11 Minor. Now, after beating out J.Storm today, IG have placed themselves firmly in the top four of the Major.\nBoth games were clinical execution by the Chinese team. IG drafted well, backed up by characteristic warmongering from star mid player Zhou \"Emo\" Yi and fantastic playmaking from Thiay \"JT-\" Jun Wen. Finally, IG’s carry Jin \"flyfly\" Zhiyi showed up on the radar. IG’s previous victories were mostly in spite rather than because of him and to see flyfly finally break out will be a definite relief for the Chinese audience.\nJ.Storm were at a loss in the first game, even after picking up the powerful Chen-Alchemist combo. The second game was a much closer affair between the two teams, and J.Storm went with what they were most comfortable with: classic North American pub Dota.\nDrafting three strength cores, J.Storm tried to take the fight to IG and succeeded in the early part. They dominated three lanes and even got away with a greedy Enigma pick. For once, it looked like Emo was having a bad game and he clearly wasn’t as comfortable on Gyrocopter compared to his usual high-octane hero pool.\nThankfully for IG, flyfly stepped up. He had a great showing on Faceless Void. Patient yet relentless, his Chronospheres secured key kills and in turn, teamfights, all without feeding away unnecessary deaths. It was a marked improvement over his previous showings, and his team will hope that this form can continue for the remainder of the Major.\nJ.Storm wouldn’t be too disheartened with their end result. Having entered the tournament after losing their star carry player, few would have expected the North American team to even break into the top half of the Major. Their three new recruits performed above expectations and the organization will look to make even bigger waves at future tournaments. J.Storm leave Chengdu $60,000 richer and with 900 Dota Pro Circuit points in the bag.\nIG aren’t done for today. The Chinese squad will move on to face Evil Geniuses later in the day. The result will determine which team will end up on the podium and get to play in front of the Chengdu crowd on the last day of the event. As one of the two Chinese teams remaining in the tournament, the home ground advantage just might be what pushes IG past their limit against the brilliant EG squad.", "meta": {}, "annotation_approver": null, "labels": [[40, 55, "ORG"], [69, 75, "GAME"], [177, 201, "TOURN"], [226, 233, "ORG"], [241, 243, "ORG"], [360, 362, "ORG"], [439, 452, "PLAYER"], [483, 502, "PLAYER"], [524, 542, "PLAYER"], [650, 656, "PLAYER"], [727, 734, "ORG"], [894, 901, "ORG"], [977, 981, "GAME"], [1319, 1321, "ORG"], [1323, 1329, "PLAYER"], [1652, 1659, "ORG"], [2008, 2015, "ORG"], [2094, 2096, "ORG"], [2159, 2172, "ORG"], [2485, 2487, "ORG"], [2443, 2445, "ORG"], [112, 129, "TOURN"], [567, 569, "ORG"], [513, 515, "ORG"], [1014, 1021, "ORG"], [1049, 1051, "ORG"], [1144, 1150, "AVATAR"], [1182, 1185, "PLAYER"], [1248, 1258, "AVATAR"], [1368, 1381, "AVATAR"], [2058, 2062, "GAME"]]}
{"id": 262, "text": "After losing to Vici Gaming in the upper bracket, Evil Geniuses got their revenge against Team Liquid for a group stage loss and secured a top-four finish at the Dota 2 MDL Chengdu Major today.\nEG dominated Liquid and showed the high level of play this roster can reach with two straight games of greatness from Artour \"Arteezy\" Babaev and Abed Yusop.\nGame one was a stomp from start to finish, with every player for EG massively contributing to the 41-10 final kill advantage. Abed’s Storm Spirit had 19 kills and 12 assists in the 31-minute win, racking up a game-high 33,383 hero damage, which was more than double both of Liquid’s core players.\nRoman \"RAMZES666\" Kushnarev continued to have a strong tournament playing with his new team, going untouched with his Omniknight and adding nine kills and 16 assists while outdueling Samuel \"Boxi\" Svahn’s Pangolier.\nArteezy’s Night Stalker paired with that dominant Storm Spirit ended up being too much for Liquid to handle. One messy teamfight ended with EG popping BKBs and finishing a push by killing off three of their opponents.\nAnd even though things looked a little better in the opening minutes of game two, an odd draft left Liquid in a bad place once the laners for EG heated up. The Europeans just couldn’t get something going. Boxi’s Earthshaker and Tal \"Fly\" Aizik made sure to have his team focus down Tommy \"Taiga\" Le’s Rubick whenever he was open, making him a non-factor in the late game.\nArteezy was in the spotlight this time with his own 19=kill performance on Faceless Void, pairing perfectly with Abed’s Kunkka that went 9/0/20. That duo showed just how powerful this team can be when they thrashed Liquid in a second straight game.\nNo one on Liquid could touch a single EG player and they were eliminated from the tournament by a team the beat in the group stage.\n\"When we played against Liquid in the group stage, as a team, we weren’t very cohesive,\" Arteezy said after the win. \"We didn’t understand the game the same way at the time. So we used the group stage to improve our own strategies, our own gameplay. It was very good practice for us as a team.\"\nEG are now guaranteed a top-four finish at the Major and will play the winner of J Storm and Invictus Gaming at 5am CT on Nov. 23 to see who will make it into the top three.", "meta": {}, "annotation_approver": null, "labels": [[16, 27, "ORG"], [50, 63, "ORG"], [90, 101, "ORG"], [194, 196, "ORG"], [207, 213, "ORG"], [312, 335, "PLAYER"], [340, 350, "PLAYER"], [417, 419, "ORG"], [649, 676, "PLAYER"], [956, 962, "ORG"], [1005, 1007, "ORG"], [1183, 1189, "ORG"], [1225, 1227, "ORG"], [1288, 1294, "PLAYER"], [1311, 1326, "PLAYER"], [1455, 1462, "PLAYER"], [1670, 1676, "ORG"], [1714, 1720, "ORG"], [1742, 1744, "ORG"], [1860, 1866, "ORG"], [1925, 1932, "PLAYER"], [2131, 2133, "ORG"], [2212, 2219, "ORG"], [2224, 2239, "ORG"], [162, 186, "TOURN"], [478, 482, "PLAYER"], [485, 497, "AVATAR"], [626, 632, "ORG"], [767, 777, "AVATAR"], [832, 851, "PLAYER"], [854, 863, "AVATAR"], [865, 872, "PLAYER"], [875, 888, "AVATAR"], [915, 927, "AVATAR"], [1365, 1381, "PLAYER"], [1384, 1390, "AVATAR"], [1568, 1572, "PLAYER"], [1530, 1543, "AVATAR"], [1575, 1581, "AVATAR"]]}
{"id": 263, "text": "Natus Vincere has gone to the Dota 2 pub scene to find its new position five support. Illias \"illias\" Ganeev, ranked fifth in the European server on the Dota 2 leaderboards, will complete Na’Vi’s roster, the organization announced today.\nNa’Vi previously benched Akbar \"SoNNeikO\" Butaev, its previous position five and captain, due to \"unsatisfactory results at [the] MDL Chengdu Major Qualifier.\" The Ukrainian organization only managed to win two games at the qualifier, losing even to pub stacks that formed for the event.\nIllias is a virtual unknown and will make his competitive debut with Na’Vi. At just 17 years old, he’s one in the long line of pubstars that other CIS organizations have plucked directly from the pipeline this year, like Virtus Pro picking up Egor \"epileptick1d\" Grigorenko and Vitalie \"Save-\" Melnic.\nIt’s unsurprising that so many CIS organizations are trying something new by recruiting young, high-skilled players with no prior professional experience, though. The region had a terrible showing at TI9, with both CIS representatives in the bottom half of the final placings. It’s the same story at the ongoing MDL Chengdu Major, where Gambit Esports and Team Spirit both finished dead last.\nNa’Vi remains a legendary name in the Dota 2 scene. The organization had its heyday during the infancy of the professional circuit, winning the first International and ending runners-up for the next two. Recent years have been less kind, however, with Na’Vi most recently finishing top-16 at TI9. The organization likely hopes that its new blood will aid its quest for parity in the 2019-2020 competitive season.", "meta": {}, "annotation_approver": null, "labels": [[0, 13, "ORG"], [30, 36, "GAME"], [86, 108, "PLAYER"], [153, 159, "GAME"], [238, 243, "ORG"], [263, 286, "PLAYER"], [526, 532, "PLAYER"], [595, 600, "PLAYER"], [747, 757, "ORG"], [769, 799, "PLAYER"], [804, 826, "PLAYER"], [1028, 1031, "TOURN"], [1140, 1157, "TOURN"], [1165, 1179, "ORG"], [1184, 1195, "ORG"], [1221, 1226, "ORG"], [1259, 1265, "GAME"], [1361, 1384, "TOURN"], [1473, 1478, "ORG"], [1513, 1516, "TOURN"], [188, 193, "ORG"], [368, 395, "TOURN"]]}
{"id": 264, "text": "Vici Gaming started off hot at the MDL Chengdu Major and have yet to meet a Dota 2 team that can truly challenge them. Another strong performance against Evil Geniuses today saw the Chinese team make it into the upper bracket finals.\nEG had some flashes of greatness, but outside of an impressive game two comeback, Vici never really looked pressured once they found a good pace.\nGame one was an absolute slaughter. Zhang \"Eurus\" Chengjun, formerly known as Paparazi, and Zeng \"Ori\" Jiaoyang tore apart EG’s lanes and led their team to a dominant 34-11 kill advantage. Even though the game lasted 40 minutes, there was never a chance for Artour \"Arteezy\" Babaev to get going on Alchemist. Vici completely shut down his support, so there was never going to be an advantage in a teamfight for the North Americans.\nThe struggles continued for EG early in game two when the team tried to bounce back with a Faceless Void-Ember Spirit front that provided them with a lot of early kill potential. But Vici were prepared. Things stalled early with the Chinese team keeping a slight lead until EG completely overextended in an attempt to capitalize on a secured Ori Kunkka kill.\nThat mistake saw Vici team wipe the North Americans while only losing Eurus on top of the bait Ori dropped.\nBut the real strength of EG’s draft lied in the late game and an impressive turn at the 53-minute mark saw Vici get completely crushed in a teamfight, losing everyone but Xiong \"Pyw\"‘ Jiahan to a backline jump by Arteezy. That quickly spiraled into a push for the throne while Vici could only watch as game two slipped away despite holding a kill advantage.\nIn the decisive third match, EG put a lot of pressure on Arteezy’s Juggernaut to hold a late draft together, which completely failed since Eurus dominated with Night Stalker.\nThe Stalker-Razor core was able to take everything EG dished out while Zhou \"Yang\" Haiyang thrived on Omniknight, setting up 26 assists for his teammates—though most of them went right to Eurus. Another stellar comeback was a far-flung dream for EG. Their plans for the post-40 push were snuffed out by the sheer dominance of Vici.\nThat 2-1 series win sets Vici up to take on the scorching hot TNC Predator team that’s only dropped a single game this entire tournament. That match will begin at 1:30am CT on Nov. 23.\nMeanwhile, EG now await the winner of Alliance and Team Liquid to see if they can survive to fight again in the lower bracket.", "meta": {}, "annotation_approver": null, "labels": [[0, 11, "ORG"], [76, 82, "GAME"], [154, 167, "ORG"], [234, 236, "ORG"], [316, 320, "ORG"], [472, 491, "PLAYER"], [416, 438, "PLAYER"], [458, 466, "PLAYER"], [638, 661, "PLAYER"], [689, 693, "ORG"], [840, 842, "ORG"], [995, 999, "ORG"], [1086, 1088, "ORG"], [1154, 1157, "PLAYER"], [1188, 1192, "ORG"], [1241, 1246, "PLAYER"], [1266, 1269, "PLAYER"], [1386, 1390, "ORG"], [1450, 1469, "PLAYER"], [1492, 1499, "PLAYER"], [1556, 1560, "ORG"], [1666, 1668, "ORG"], [1776, 1781, "PLAYER"], [1863, 1865, "ORG"], [1883, 1902, "PLAYER"], [2000, 2005, "PLAYER"], [2058, 2060, "ORG"], [2138, 2142, "ORG"], [2169, 2173, "ORG"], [2206, 2218, "ORG"], [2340, 2342, "ORG"], [2367, 2375, "ORG"], [2380, 2391, "ORG"], [35, 52, "TOURN"], [503, 505, "ORG"], [678, 687, "AVATAR"], [903, 929, "AVATAR"], [1158, 1164, "AVATAR"], [1304, 1306, "ORG"], [1694, 1701, "PLAYER"], [1704, 1714, "AVATAR"], [1797, 1810, "AVATAR"], [1816, 1829, "AVATAR"], [1914, 1924, "AVATAR"]]}
{"id": 265, "text": "ESL One is making its debut on the West Coast in partnership with Valve next year. ESL One Los Angeles 2020 is bringing a Dota Pro Circuit Major back to North America for the first time since the format’s inception in 2017.\nThere have been several Minor tournaments held in the U.S. since then, such as Dota Summit 11 at the start of November, but this partnership is bringing the production of ESL and Valve together to create what will essentially be a Super Major in one of the esports hubs of the world.\n\"Los Angeles is known for world class entertainment and that is exactly what we aim to deliver with the LA Major,\" said Ulrich Schulze, ESL’s senior vice president of product. \"We are finally bringing our ESL Dota 2 flagship competition to the US West Coast for the first time and we are proud to deliver world-class Dota 2 action to the local community.\"\nSince this is a DPC Major, there will be 16 teams competing at the event. Fifteen of those teams will make it in through the regional qualifiers while the final spot will be reserved for the winner of the unannounced Minor tournament that will run from March 3 to 8.\nThe regional qualifiers for the event will begin on Feb. 9, just two weeks after the second Major of the season, DreamLeague Season 13, will conclude.\nAs usual, the prize pool for the Major is set at $1 million and there are 15,000 DPC points up for grabs, too. Since it’s the third big DPC event, this could become the turning point of the season for many teams, just like DreamLeague Season 11 was for Vici Gaming last season.\nIn typical Major fashion, the group stage will take place away from the main venue. Tickets for the main event will go on sale Nov. 21 on the official ESL event page.\nThe last time a Dota Major was held in the U.S. was The Boston Major and OG dominated that event. And we could see that happen again when ESL One Los Angeles comes to the Shrine Auditorium from March 20 to 22.", "meta": {}, "annotation_approver": null, "labels": [[0, 7, "TOURN"], [83, 107, "TOURN"], [122, 126, "GAME"], [303, 317, "TOURN"], [455, 466, "TOURN"], [825, 831, "GAME"], [1244, 1265, "TOURN"], [1505, 1526, "TOURN"], [1535, 1546, "ORG"], [1800, 1802, "ORG"], [1743, 1747, "GAME"], [1865, 1884, "TOURN"], [395, 398, "SPONS"], [644, 647, "SPONS"], [717, 723, "GAME"], [713, 716, "SPONS"], [1711, 1714, "SPONS"], [1783, 1795, "TOURN"]]}
{"id": 266, "text": "Team Aster destroyed Gambit Esports in a best-of-one in the lower bracket of the MDL Chengdu Major. The result meant that both CIS teams, Team Spirit and Gambit Esports, will be dead last at the first Major of the season.\nBoth Aster and Gambit are sporting revamped lineups, having recruited some of the brightest talents in their respective regions. An exit at this stage would have been a failure for either team, and the game was expected to be even between two sides that unexpectedly fell to the lower bracket.", "meta": {}, "annotation_approver": null, "labels": [[0, 10, "ORG"], [21, 35, "ORG"], [138, 149, "ORG"], [154, 168, "ORG"], [227, 232, "ORG"], [237, 243, "ORG"], [81, 98, "TOURN"]]}
{"id": 371, "text": "Dignitas reportedly signs Grig, Aphromoo, and Froggen to its 2020 LCS roster | Dot Esports\nCan Dignitas exceed people’s expectations and succeed in the new year?\nAfter a relatively odd offseason, Dignitas is reportedly signing former 100 Thieves support Zaqueri “Aphromoo” Black, mid laner Henrik “Froggen” Hansen and jungler Jonathan “Grig” Armao to fill in the team’s roster for 2020, according to ESPN’s Jacob Wolf.\nSix days ago, the team confirmed the acquisition of former TSM Academy AD carry Johnson “Johnsun” Nguyen—the 20-year old is a rookie bottom laner who will be making his LCS debut with Dignitas next year. If these reports are true, the rest of the team will be made up of several LCS veterans who were replaced on their respective teams.\nAphromoo was replaced by 24-year old William “Stunt” Chen, after 100 Thieves’ horrible performances during both the 2019 Spring and Summer Splits. Meanwhile, Grig hasn’t played in the LCS since June 2019 with TSM, and Froggen was replaced with Greyson “Goldenglue” Gilmer on the Golden Guardians.\nBeforehand, Dignitas actually made several roster moves that left some League fans and analysts scratching their heads. One of the biggest decisions the management made was giving Heo “Huni” Seung-hoon a reported $2.3 million contract over two years.\nMany people agreed that this was a huge overpay for a player who has been a coinflip player for the past two years. They also traded talented support Philippe “Vulcan” Laflamme, sold contract rights for AD carry Cody Sun, and didn’t pick up the team option of mid laner Tanner Damonte, which were unpopular decisions in the NA League community as well.", "meta": {}, "annotation_approver": null, "labels": [[26, 30, "PLAYER"], [32, 40, "PLAYER"], [46, 54, "PLAYER"], [66, 70, "TOURN"], [0, 9, "ORG"], [95, 104, "ORG"], [196, 205, "ORG"], [254, 278, "PLAYER"], [290, 313, "PLAYER"], [326, 347, "PLAYER"], [478, 489, "ORG"], [499, 523, "PLAYER"], [603, 611, "ORG"], [588, 591, "TOURN"], [698, 701, "TOURN"], [756, 765, "PLAYER"], [793, 813, "PLAYER"], [821, 832, "ORG"], [234, 245, "ORG"], [940, 944, "TOURN"], [965, 968, "ORG"], [914, 919, "PLAYER"], [974, 982, "PLAYER"], [1000, 1027, "PLAYER"], [1035, 1051, "TOURN"], [1065, 1074, "ORG"], [1124, 1131, "GAME"], [1233, 1254, "PLAYER"], [1454, 1480, "PLAYER"], [1516, 1524, "PLAYER"], [1574, 1588, "PLAYER"]]}
{"id": 372, "text": "hal, Sangyoon, and Lira are creating a new League team called Seorabeol Gaming\nThey’re looking for a mid laner and support.\nTop laner Park “Thal” Kwon-hyuk, AD carry Gwon “Sangyoon” Sang-yun, jungler Nam “Lira” Tae-yoo, and popular Korean streamer Lee Sang-ho revealed today that they’re forming a League of Legends team named Seorabeol Gaming.\nTheir intentions are to first qualify for Challengers Korea, while the ultimate goal is to earn a spot in the LCK in the future. It’ll be tough, though, since there are so many top-tier organizations moving into the Korean professional scene.\nThal last played for Hanwha Life Esports this year, while Sangyoon recently retired from pro play. Before his retirement, he was the bottom lane carry for Hanwha Life. Lira, on the other hand, was previously the jungler for Clutch Gaming in 2018 and 2019. Each player had a down year in 2019, but they’ve come together to find more success in 2020.\nThe team is still looking for a mid laner and support. Only players who are Grandmaster and above will be considered for the positions.\nMany people are interested to see how this team will perform since all three players weren’t the strongest performers this year. They still clearly lack firepower, so they’ll need to pick up some strong candidates to fill in their missing spots.", "meta": {}, "annotation_approver": null, "labels": [[0, 3, "PLAYER"], [5, 13, "PLAYER"], [19, 24, "PLAYER"], [62, 78, "ORG"], [134, 155, "PLAYER"], [166, 190, "PLAYER"], [200, 218, "PLAYER"], [248, 259, "PLAYER"], [298, 315, "GAME"], [43, 50, "GAME"], [327, 343, "ORG"], [387, 404, "TOURN"], [455, 458, "TOURN"], [588, 593, "PLAYER"], [609, 628, "ORG"], [646, 654, "PLAYER"], [743, 754, "ORG"], [756, 760, "PLAYER"], [812, 825, "ORG"]]}
{"id": 373, "text": "Kumo will be the Evil Geniuses’ starting top laner\nThe 19-year-old is getting his first big break into the LCS.\nEvil Geniuses revealed today that Kumo will be the League of Legends team’s starting top laner in the 2020 LCS Spring Split after playing for Cloud9’s Academy team for the majority of his career. He was able to play for C9’s LCS team for a couple of games in 2019, but this will be his first time as a full-time starter on a main roster.\nKumo joins former C9 teammates Tristan “Zeyzal” Stidam and Dennis “Svenskeren” Johnsen on the squad, as well as former 100 Thieves AD carry Bae “Bang” Jun-sik, who joined EG four days ago. The only position that needs to be filled on the team is the mid lane—there haven’t been many reports on who the final player on EG could be, though.\nWith three former C9 players joining the team, EG will have plenty of synergy to work off of next year. Svenskeren and Zeyzal were essential parts of their team’s success this past year and should help this new roster find success right off the bat. Kumo also has some experience playing with the two former C9 players, which could make his transition into the league a bit easier.\nAs for mid laners, EG will need to reach into the North American resident pool for talent since Svenskeren and Bang are taking up both of the team’s import slots. One name that comes to mind is former FlyQuest mid laner Eugene “Pobelter” Park, but he recently confirmed that he won’t be playing in the LCS this coming season. Another possibility is Tanner Damonte, who’s showed plenty of promise and growth this year with Clutch Gaming.\nEG’s current lineup looks decent, but there are plenty of question marks that surround this roster—from Kumo’s rookie season in the LCS to Bang and Zeyzal’s synergy in the bottom lane. Until EG announces its mid laner, however, it’ll be hard to judge this team’s true potential in the organization’s return to competitive League.", "meta": {}, "annotation_approver": null, "labels": [[0, 5, "PLAYER"], [17, 30, "ORG"], [107, 110, "TOURN"], [112, 125, "ORG"], [146, 151, "PLAYER"], [163, 180, "GAME"], [214, 235, "TOURN"], [254, 260, "ORG"], [332, 334, "ORG"], [337, 341, "TOURN"], [450, 455, "PLAYER"], [468, 470, "ORG"], [481, 504, "PLAYER"], [509, 536, "PLAYER"], [569, 580, "ORG"], [590, 608, "PLAYER"], [621, 624, "ORG"], [768, 771, "ORG"], [807, 810, "ORG"], [836, 839, "ORG"], [893, 904, "PLAYER"], [908, 915, "PLAYER"], [1039, 1044, "PLAYER"], [1097, 1100, "ORG"], [1190, 1193, "ORG"], [1267, 1278, "PLAYER"], [1282, 1287, "PLAYER"], [1372, 1381, "ORG"], [1391, 1413, "PLAYER"], [1473, 1477, "TOURN"], [1520, 1534, "PLAYER"], [1593, 1606, "ORG"], [1608, 1610, "ORG"], [1712, 1716, "PLAYER"], [1740, 1744, "ORG"], [1747, 1752, "PLAYER"], [1756, 1762, "PLAYER"], [1799, 1802, "ORG"]]}
{"id": 374, "text": "DAMWON Gaming reportedly headed into 2020 with the same starting roster\nThis young fiery squad is ready to run it back.\nAfter a relatively successful inaugural year in the LCK, DAMWON Gaming has reportedly decided to build on the success of 2019 and stick with the same League of Legends roster for next year.\nDAMWON has its entire starting roster under contract until November 2020, according to FOMOS reporter Kenzi. And since they gained plenty of experience both domestically and internationally in 2019, they should be able to improve their strategies and playstyle for next year’s Spring Split.\nDAMWON recently parted ways with several of its substitute players and coaches, including top laner Lee “Flame” Ho-jong, jungler Son “Punch” Min-hyuk, AD carry Lee “Aries” Chae-hwan, coach Kim Jeong-soo—who’s now the head coach of T1—and coach Song “Morning” Chang-geun.\nThis is one of the rare LCK teams that will be staying with its roster through the 2019 offseason. Multiple players have switched teams over the past week and many top-tier organizations now look incredibly different, like T1, Griffin, and Gen.G.\nIt’s unclear if this decision will help or hinder the team’s efforts next season, though. Some people believed that DAMWON needed to make some changes to its roster, but many seem to forget that this was their first year in the LCK. There’s plenty of potential on this roster, and given enough time, most of these players can blossom into superstars.", "meta": {}, "annotation_approver": null, "labels": [[0, 13, "ORG"], [172, 175, "TOURN"], [177, 190, "ORG"], [270, 287, "GAME"], [310, 317, "ORG"], [601, 607, "ORG"], [701, 720, "PLAYER"], [730, 750, "PLAYER"], [761, 782, "PLAYER"], [832, 834, "ORG"], [896, 900, "ORG"], [1095, 1097, "ORG"], [1099, 1106, "ORG"], [1112, 1117, "ORG"], [1235, 1241, "ORG"], [1347, 1350, "TOURN"]]}
{"id": 375, "text": "Sneaky and Bang are NA’s new All-Stars after Bjergsen and Doublelift decline invites\nThey won’t be pulling off another duo cosplay, though.\nNA superstars Søren “Bjergsen” Bjerg and Yiliang “Doublelift” Peng have both declined their invites to the 2019 League of Legends All-Star Event. That means Evil Geniuses’ Bae “Bang” Jun-sik and former Cloud9 starting AD carry Zachary “Sneaky” Scuderi will take their place in Las Vegas next month.\nLast year, both Sneaky and Bang went to the All-Star Event, but from different regions—the former was still playing for NA, while the latter represented South Korea with then-SK Telecom T1. This time, however, Sneaky and Bang will both represent NA with Bjergsen and Doublelift opting out of the event.\nIf you were hoping that Sneaky and Bang were going to treat their fans to another exciting duo cosplay like last year, you’re going to be sorely disappointed, however. Bang confirmed that he won’t be attending the event in cosplay this year.\nSneaky, however, did ask his fans which character he should cosplay, which means that he’s probably looking to play in full costume once again. Last year, he and Bang both dressed up as Xayah in two of the best cosplays we’ve seen of the character.\nYou can catch Bang and Sneaky in action when the 2019 All-Star Event takes place from Thursday, Dec. 5 to Saturday, Dec. 7.", "meta": {}, "annotation_approver": null, "labels": [[0, 7, "PLAYER"], [11, 16, "PLAYER"], [45, 54, "PLAYER"], [58, 69, "PLAYER"], [154, 176, "PLAYER"], [181, 206, "PLAYER"], [297, 310, "ORG"], [312, 330, "PLAYER"], [342, 349, "ORG"], [367, 391, "PLAYER"], [455, 461, "PLAYER"], [466, 470, "PLAYER"], [614, 627, "ORG"], [649, 656, "PLAYER"], [660, 665, "PLAYER"], [693, 702, "PLAYER"], [706, 717, "PLAYER"], [766, 773, "PLAYER"], [777, 782, "PLAYER"], [910, 915, "PLAYER"], [984, 990, "PLAYER"], [1146, 1151, "PLAYER"], [1247, 1252, "PLAYER"], [1256, 1263, "PLAYER"], [1170, 1176, "AVATAR"]]}
{"id": 376, "text": "Invictus Gaming denies TheShy transfer rumors and threatens to take legal action\n“We ask people to not believe in such nonsensical rumors.”\nChinese organization Invictus Gaming denied rumors that top laner Kang “TheShy” Seung-lok will be leaving the League of Legends team, the org revealed on Weibo yesterday.\n“The recent rumors surrounding TheShy on various online communities have all been maliciously fabricated,” IG said. “Currently, such rumors are affecting the players’ reputation in a negative way.”\nTheShy has been widely considered one of the most valuable players in League this offseason and has been coveted in the free agency market since his Worlds-winning run last year. His team’s performance dipped in 2019, but TheShy’s top lane prowess and his playmaking potential have remained in the upper echelon of competitive play.\nDespite the rumors of his possible departure from the team, IG insists that he’ll remain with the organization for the 2020 season and beyond. “TheShy is currently in a contract period with IG, and TheShy himself has made no clear intention to transfer,” IG said on Weibo.\n“We will be taking legal action to those that personally attack [TheShy] and spread rumors about him,” IG added. “All official news during the free agency season will be coming from the team directly, so we ask people to not believe in such nonsensical rumors.”\nTheShy commented on the issue, confirming he has no intention of leaving the team. The reason he joined IG is because of his affection for his teammates. “I haven’t asked for a higher salary for the two years since I joined,” he said.", "meta": {}, "annotation_approver": null, "labels": [[0, 15, "ORG"], [23, 30, "PLAYER"], [161, 176, "ORG"], [206, 229, "PLAYER"], [250, 267, "GAME"], [342, 349, "PLAYER"], [418, 421, "ORG"], [509, 516, "PLAYER"], [579, 585, "GAME"], [731, 737, "PLAYER"], [902, 905, "ORG"], [986, 993, "PLAYER"], [1032, 1034, "ORG"], [1040, 1047, "PLAYER"], [1097, 1100, "ORG"], [1180, 1186, "PLAYER"], [1218, 1221, "ORG"], [1377, 1384, "PLAYER"], [1481, 1484, "ORG"]]}
{"id": 377, "text": "G2 Esports head to Worlds 2019 finals after taking down SK Telecom T1\nThis might be the year Europe takes it all home.\nG2 Esports have finally done what no other team in the world could do—they’ve taken down SK Telecom T1 at the 2019 World Championship semifinals, in one of the greatest series of all time. Europe’s dream of the competitive Grand Slam is alive and kicking, while Korea’s redemption run has been cut short.\nIt was an intense battle for all four games, with each team showing why they are two of the best in the world. SKT took pretty substantial leads in each match, with some great plays from jungler Kim “Clid” Tae-min and top laner Kim “Khan” Dong-ha. G2 refused to roll over, though. In every game, they fought back with surprising ferocity and ingenuity.\nWhether it was a quick pick on an overextended target, or forcing summoner usages in skirmishes, G2 used small avenues to start up a comeback. Later on, they simply outplayed SKT in multiple teamfights. In fact, superstar mid laner Lee “Faker” Sang-hyeok made several huge mistakes in positioning and execution that would cost his team dearly throughout the series, especially in the last game of the day.\nIt was a story that was constantly told throughout the five games. It seemed like the pressure was actually getting to the perennial world champion, and although his teammates were also making critical errors, it felt like his mistakes were magnified and twice as important.\nUltimately, G2 have shown that they must be in the discussion for one of the best teams of all time. Their creativity, skill, and team synergy is better than almost every team in the world today, and they are headed to the finals because of it. Marcin “Jankos” Jankowski was brilliant this series. He was able to help his side lanes out whenever they were put behind, and his ability to find picks were key for G2’s success.\nOn the other hand, this was the first time that SKT attended Worlds but failed to make the finals. Their revenge tour has been stopped in its tracks, and although they are still an incredibly strong team, there’s no doubt that this roster will be thinking about this loss for months to come. Each game was well within their grasp, but they were simply outgunned by what looks like the best team in the world.\nG2 will now look to solidify their legacy and lock their place in history, when they face off against China’s FunPlus Phoenix on Sunday, Nov. 10 at 6am CT.", "meta": {}, "annotation_approver": null, "labels": [[0, 10, "ORG"], [56, 69, "ORG"], [19, 30, "TOURN"], [119, 129, "ORG"], [208, 221, "ORG"], [229, 252, "TOURN"], [535, 539, "ORG"], [619, 637, "PLAYER"], [652, 670, "PLAYER"], [672, 674, "ORG"], [952, 956, "ORG"], [1009, 1031, "PLAYER"], [1470, 1473, "ORG"], [1703, 1728, "PLAYER"], [1931, 1935, "ORG"], [1944, 1951, "TOURN"], [2292, 2295, "ORG"], [2402, 2417, "ORG"]]}
{"id": 378, "text": "Caps vs. Faker: The best in the West takes on a god\nCan Caps beat Faker for a second time this year?\nThe LPL’s FunPlus Phoenix dismantled Invictus Gaming in the Worlds 2019 semifinals this morning, usurping the former League of Legends world champions and eliminating them from the tournament. Mid laner Kim “Doinb” Tae-sang now stands tall, eagerly awaiting his next opponent. But who will join him on stage in the finals?\nOn one hand, there’s SK Telecom T1’s Lee “Faker” Sang-hyeok, the Unkillable Demon King, the final boss, the best of the best: the greatest League player of all time.\nIn a career spanning six years, Faker has remained in the upper echelon of competitive play, winning eight domestic titles and blitzing through three world championships. He’s the original playmaker, the most famous player in the game’s history, and one of the biggest names in all esports.\nOn the other, there’s Rasmus “Caps” Winther—G2 Esports’ 19-year-old mid laner from Denmark.\nAt last year’s Worlds he was the underdog, but against all the odds, he made it to the finals. He may have lost, crumbling to IG at the last hurdle. But this time it’s different. He’s back, and he’s looking better than ever.\nIf anyone can take on Faker in the head-to-head matchup—it’s Caps.\nAll eyes were on Luka “Perkz” Perković in the quarterfinals between G2 and Damwon Gaming. The “MVP” of the series dominated Sin “Nuclear” Jeong-hyeon in the bot lane, racking up a substantial kill-death ratio. But while Perkz was flashing forwards and picking up the kills, Caps was silently pulling the strings and leading the team to the win.\nHe completely shut down Heo “ShowMaker” Soo and helped facilitate his team with constant pressure in the side lanes. After consistently winning the mid lane matchup and forcing ShowMaker behind his tower, Caps was free to roam across the map, snowballing both the top and the bot side.\nIn the end, Caps’ performance on Syndra, Ryze, and Yasuo orchestrated the 3-1 victory, allowing the team to convincingly advance to the next stage of the competition. There waits SKT: Faker’s team.\nAfter an impressive group stage in Berlin, Germany—where they dropped just one game to Fnatic—SKT have positioned themselves as the favorites of the tournament. The team has played to their strengths, forcing early game pressure and drafting lane-dominant counter picks—to great success.\nKim “Khan” Dong-ha and Kim “Clid” Tae-min have been exceptional, running rampant across the map and manhandling Splyce in the quarterfinals but superstar mid-laner Faker has left much to be desired.\nMatching up against rookie Marek “Humanoid” Brázda, Faker looked uncharacteristically out of his depth; stumbling in the laning phase and failing to make an impact. Even on his comfort pick, Azir, and Ryze, he was reluctant to make plays.\nHumanoid took the lead on multiple occasions, resulting in Faker overstaying his welcome, needlessly sacrificing his lane, and getting caught in the river in Lee “Wolf” Jae-wan-esque fashion.\nFaker’s famed composure, his consistency, and his playmaking prowess were nowhere to be seen in the best-of-five series. He played scared, opting for a low-risk low-reward playstyle, and finding little luck.\nSplyce’s self-inflicted wounds in the top and support positions were enough for SKT to easily clean up, taking the brisk 3-1 victory. But Faker’s poor performance doesn’t bode well for the team.\nIf Faker lets his guard down in the semifinals and allows Caps to fully exert map pressure, it could be game, set, and match for G2.\nUnlike Humanoid, Caps isn’t afraid to make the first move. He’s not intimidated by Faker, and his capacity to duel, roam, and tower dive with his team gives him the advantage in the matchup.\nThe last time the two met was at MSI in May. SKT narrowly lost the series 3-2, falling one game short of the finals. Caps crushed Faker, exposing his weaknesses, and prematurely kicking him out of the tournament. And he has the chance to do it again this weekend.\nBut Faker is the face of SKT. He’s the leader, the shot caller, and the mouthpiece for the team. Even if he fails to showcase his mechanical skills, he can still steer the team to the win. He has a winning mentality and if that means sacrificing resources, falling behind in CS, and giving up his lane, he’ll do it.\nWhatever the outcome, the winner will pave their way in League of Legends history.", "meta": {}, "annotation_approver": null, "labels": [[0, 5, "PLAYER"], [9, 14, "PLAYER"], [56, 61, "PLAYER"], [66, 72, "PLAYER"], [105, 108, "TOURN"], [111, 126, "ORG"], [138, 153, "ORG"], [218, 235, "GAME"], [304, 324, "ORG"], [445, 458, "ORG"], [461, 483, "PLAYER"], [622, 628, "PLAYER"], [903, 924, "PLAYER"], [925, 935, "ORG"], [988, 995, "TOURN"], [1099, 1102, "ORG"], [1220, 1226, "PLAYER"], [1259, 1263, "PLAYER"], [1282, 1303, "PLAYER"], [1333, 1336, "ORG"], [1340, 1353, "ORG"], [1389, 1414, "PLAYER"], [1485, 1491, "PLAYER"], [1539, 1544, "PLAYER"], [1634, 1653, "PLAYER"], [1787, 1797, "PLAYER"], [1815, 1820, "PLAYER"], [1908, 1912, "PLAYER"], [2075, 2078, "ORG"], [2080, 2085, "PLAYER"], [2181, 2187, "ORG"], [2188, 2192, "ORG"], [2382, 2400, "PLAYER"], [2405, 2423, "PLAYER"], [2546, 2551, "PLAYER"], [2608, 2631, "PLAYER"], [2633, 2639, "PLAYER"], [2820, 2829, "PLAYER"], [2978, 3002, "PLAYER"], [3012, 3017, "PLAYER"], [2879, 2885, "PLAYER"], [3300, 3304, "ORG"], [3358, 3363, "PLAYER"], [3418, 3423, "PLAYER"], [3473, 3477, "PLAYER"], [3544, 3546, "ORG"], [3555, 3563, "PLAYER"], [3565, 3570, "PLAYER"], [3631, 3636, "PLAYER"], [3772, 3776, "TOURN"], [3784, 3788, "PLAYER"], [3856, 3861, "PLAYER"], [3869, 3874, "PLAYER"], [4007, 4013, "PLAYER"], [4028, 4031, "ORG"], [4375, 4392, "GAME"], [1929, 1935, "AVATAR"], [1937, 1941, "AVATAR"], [1947, 1953, "AVATAR"], [2494, 2501, "ORG"], [2772, 2776, "AVATAR"], [2782, 2786, "AVATAR"], [3220, 3226, "ORG"]]}
{"id": 379, "text": "FPX advance to Worlds 2019 finals after a massive throw by IG\nIG’s carries walked into FPX face first.\nThe champions have fallen. The LPL’s FunPlus Phoenix took down defending champions Invictus Gaming 3-1 today during the League of Legends World Championship semifinals and will now move to the final leg of the tournament.\nIG were on their way to extending their semifinals series against FPX when Gao “Ning” Zhen-Ning and Wang “Baolan” Liu-Yi set up the perfect team fight. The two drew FPX into IG’s jungle. Baolan on Rakan had the perfect 3-man knock up and charm onto FPX. Song “Rookie” Eui-jin ulted right onto FPX with follow-up by Yu “JackeyLove” Wen-Bo and Kang “TheShy” Seung-lok. FPX were wiped clean and IG’s late game composition was engaged.\nIG had the scaling, they had the teamfight, everything seemed to be in their hands, but they choked. TheShy and JackeyLove walked face-first into FPX’s jungle and straight into four members of FPX. Ning, Baolan, and Rookie were not in range or prepared. FPX quickly turned and deleted the two IG carries.\nLeague of Legends fans and casters alike were baffled by this decision. No words could describe the mistake that just transpired. And once again IG were on the back foot. They managed to push into FPX’s middle inhibitor, but TheShy was caught out and died with his flash and ultimate still up.\nDespite the questionable choices made in game four, IG put up quite a fight throughout the series. Game two was an incredible back and forth bloodbath that ended in 60 deaths across the board. And broke the Worlds record for second-highest deaths in a single game. FPX proved to be the better LPL team yet again and eliminated the reigning World champions.\nFor FPX this is a huge milestone for a fresh organization. The team joined the LPL in 2018 and quickly rose to the top in 2019 after switching in Kim “Doinb” Tae-sang and Gao “Tian” Tian-Liang. Now, they are one series away from winning a Championship title during their first Worlds appearance.\nTomorrow fans have the last semifinal series between G2 Esports and SK Telecom T1. After which, we’ll learn who FPX will be facing during the World finals on Sunday Nov. 10 6am CT.", "meta": {}, "annotation_approver": null, "labels": [[0, 4, "ORG"], [15, 26, "TOURN"], [59, 62, "ORG"], [62, 64, "ORG"], [87, 91, "ORG"], [134, 137, "TOURN"], [140, 155, "ORG"], [186, 201, "ORG"], [223, 259, "TOURN"], [325, 328, "ORG"], [391, 394, "ORG"], [400, 420, "PLAYER"], [425, 445, "PLAYER"], [490, 494, "ORG"], [499, 501, "ORG"], [512, 519, "PLAYER"], [574, 577, "ORG"], [579, 600, "PLAYER"], [618, 622, "ORG"], [640, 662, "PLAYER"], [667, 690, "PLAYER"], [692, 696, "ORG"], [757, 759, "ORG"], [717, 719, "ORG"], [858, 865, "PLAYER"], [869, 880, "PLAYER"], [903, 906, "ORG"], [950, 953, "ORG"], [955, 959, "PLAYER"], [961, 967, "PLAYER"], [973, 980, "PLAYER"], [1011, 1015, "ORG"], [1050, 1053, "ORG"], [1062, 1079, "GAME"], [1207, 1210, "ORG"], [1259, 1262, "ORG"], [1287, 1293, "PLAYER"], [1408, 1411, "ORG"], [1621, 1625, "ORG"], [1649, 1653, "TOURN"], [1717, 1721, "ORG"], [1792, 1796, "TOURN"], [1859, 1879, "PLAYER"], [1884, 1905, "PLAYER"], [1990, 1997, "TOURN"], [2062, 2072, "ORG"], [2077, 2090, "ORG"], [2121, 2125, "ORG"], [522, 528, "AVATAR"]]}
{"id": 380, "text": "Can G2 repeat their MSI success and beat SKT at Worlds 2019?\nSKT are ready for revenge against the LEC champions.\nThirteen regions were represented at this year’s League of Legends World Championship. Now, only three remain.\nThis Sunday, one of either the LEC or LCK will be sent home when G2 Esports and SK Telecom T1 go head-to-head in the semifinals. Will G2 prove their dominance against SKT once again or will SKT continue on the warpath to reclaiming their throne?\nEarlier this year, the two teams faced off in the MSI semifinals. The two teams were evenly matched until G2 pulled ahead in the fifth game. G2 went on to win the tournament and swept through the LEC Summer Split before Worlds.\nSKT, however, dropped to ninth place during the LCK Summer Split. They seemed to be in a slump. But beginning in week four, the team went on a nine-match win streak to secure a spot in the playoffs. SKT’s rise didn’t stop there. They tore through the playoffs to claim first in the region. Now, as the last remaining LCK team, SKT are primed for a total takeover.\nGoing into Worlds, SKT were placed into an unexpectedly tough group with Fnatic and Royal Never Give Up. But they still came out with a 5-1 record. The wins weren’t always one-sided, however. The games were often a contest of which team could gain an edge, especially against RNG. SKT, however, proved time and time again they have the superior teamfight. Even if SKT fell behind early, they seemed to always whittle their way back into a game by outmaneuvering their opponents.\nLee “Faker” Sang-hyeok has returned to form, tearing up the mid lane and controlling the tempo of the game through roams. Side-by-side with Kim “Clid” Tae-min, the two are a roaming duo that helps create space for the rest of their team. Clid alone is arguably the biggest reason for SKT’s success this Worlds. He’s the one who aptly enables Faker to move across the map and provides a lot of the set up for the team.\nPark “Teddy” Jin-seong, on the other hand, has essentially been the ideal ADC. His positioning has been immaculate, oftentimes skirting between life and death as he navigates through fights. He’s a consistent source of damage that SKT can depend on.\nAlthough SKT have had a commanding showing thus far, the team faltered during their quarterfinal series against Splyce, where SKT were expected to shine. By game three, it seemed like SKT took a step back and lost their proactivity. Splyce were able to exert so much pressure in the early game that SKT couldn’t come back. Even in game four, SKT looked out of sorts and uncoordinated. Ideally, SKT’s series with Splyce should reinvigorate them to perform by the time they face G2.\nThe pride of EU\nG2 already topped the LEC standings when they joined the region in 2016. But this year, they’ve doubled down on their position as best in the West. Two LEC titles, along with an MSI championship, and now G2 are on their way to claiming a Worlds title.\nThey showed a moment of weakness against Griffin, which cost them the first seed in their group. But they’ve otherwise demonstrated their superior map control and glided through just about every other match so far. Even during their difficult series against DAMWON Gaming, G2 seemed to always have a plan of attack. If their opponent claims a turret, G2 will likely be taking an objective of their own in response.\nLuka “Perkz” Perković has been the star for G2, enabling them to play just about any style due to his diverse champion pool with options like Yasuo and Zoe. Unfortunately for G2, non-traditional bot lanes have proven to be inferior to traditional lanes. But there’s the opportunity to surprise SKT with a sneaky pick from Perkz. Marcin “Jankos” Jankowski is often the one leading G2 through the early game with well-timed tower dives. Along with Rasmus “Caps” Borregaard Winther and Martin “Wunder” Nordahl Hansen, who commonly play pressure lanes, G2 can maintain lane priority. This allows the team to stay ahead even when their opponents seemingly take a good trade.\nWhere G2 may struggle, however, is in the early game. Their two losses against Griffin were both lost early on. Considering SKT have significantly amped up their early game, this will likely be a point of contention throughout the series. Still, G2 have already beaten SKT in a best-of-five. Now it’s their time to make a statement by defeating them once again.\nG2 and SKT will battle each other for the last spot in the 2019 Worlds final on Sunday, Nov. 3 at 5am CT.", "meta": {}, "annotation_approver": null, "labels": [[4, 7, "ORG"], [20, 24, "TOURN"], [41, 45, "ORG"], [48, 59, "TOURN"], [61, 65, "ORG"], [99, 103, "TOURN"], [163, 199, "TOURN"], [256, 259, "TOURN"], [263, 267, "TOURN"], [290, 300, "ORG"], [305, 318, "ORG"], [359, 362, "ORG"], [392, 396, "ORG"], [415, 419, "ORG"], [521, 524, "TOURN"], [577, 580, "ORG"], [612, 615, "ORG"], [667, 683, "TOURN"], [691, 697, "TOURN"], [699, 702, "ORG"], [747, 763, "TOURN"], [898, 901, "ORG"], [1016, 1020, "TOURN"], [1026, 1030, "ORG"], [1082, 1086, "ORG"], [1074, 1080, "TOURN"], [1136, 1143, "ORG"], [1147, 1166, "ORG"], [1339, 1342, "ORG"], [1344, 1347, "ORG"], [1427, 1431, "ORG"], [1542, 1565, "PLAYER"], [1682, 1700, "PLAYER"], [1780, 1785, "PLAYER"], [1826, 1829, "ORG"], [1845, 1851, "TOURN"], [1884, 1890, "PLAYER"], [1960, 1982, "PLAYER"], [2191, 2195, "ORG"], [2219, 2223, "ORG"], [2336, 2339, "ORG"], [2394, 2398, "ORG"], [2509, 2513, "ORG"], [2552, 2556, "ORG"], [2604, 2607, "ORG"], [2687, 2689, "ORG"], [2707, 2710, "ORG"], [2729, 2733, "TOURN"], [2859, 2863, "TOURN"], [2885, 2889, "TOURN"], [2911, 2914, "ORG"], [3000, 3007, "ORG"], [3217, 3230, "ORG"], [3232, 3235, "ORG"], [3310, 3312, "ORG"], [3374, 3395, "PLAYER"], [3418, 3420, "ORG"], [3549, 3551, "ORG"], [3668, 3672, "ORG"], [3696, 3701, "PLAYER"], [3703, 3728, "PLAYER"], [3754, 3757, "ORG"], [3820, 3852, "PLAYER"], [3857, 3887, "PLAYER"], [3923, 3926, "ORG"], [4050, 4053, "PLAYER"], [4123, 4131, "ORG"], [4168, 4172, "ORG"], [4290, 4293, "ORG"], [4313, 4317, "ORG"], [4406, 4409, "ORG"], [4413, 4417, "ORG"], [4465, 4476, "TOURN"], [2443, 2450, "ORG"], [2622, 2629, "ORG"], [2322, 2328, "ORG"], [3516, 3522, "AVATAR"], [3526, 3529, "AVATAR"]]}
{"id": 381, "text": "CoreJJ says North America needs to take League solo queue seriously\n“We are all from solo Q.”\nTeam Liquid’s MVP support and former world champion Jo “CoreJJ” Yong-in gave his thoughts on the importance of League of Legends solo queue last night.\nAfter all three North American teams failed to advance from the group stage of Worlds 2019, fans and players alike are trying to figure out what went wrong. Some have blamed NA’s poor performance on the lack of homegrown talent, while others have targeted the region’s overreliance on import slots. CoreJJ had other ideas.\n“There is only one way NA plays well in Worlds consistently,” CoreJJ said. “Every pro must think about how important solo Q is and play for LP srsly so that we can find good rookies.”\nOut of the 15 LCS players who went to Worlds, only eight of them are from the region. The other seven were imported from either Europe or South Korea. CoreJJ’s solution is to stop investing in foreign talent, and instead, look closer to home.\n“Just don’t forget how we could be a progamer, we are all from solo Q,” he said. “Let’s make good rank game culture together.”\nNA solo queue is considered one of the worst regional ladders in League. It’s taken seriously by very few players, with the vast majority of pros avoiding it altogether. Rather than grinding and honing their skills against a range of players, pros often choose to play in-house scrims instead.\nOne of the biggest reasons for this is server instability. The NA pros live in Los Angeles, close to the LCS studios—but League’s main server hub is thousands of miles away in Chicago. As a result, pros are forced to compete with 60 to 70 ping, which is much higher than what most players deal with in regions like Europe or South Korea.\nWhile in-house scrims might sound like a good idea to some, it completely cuts out the need to play solo queue, making it difficult to recruit any potential rookie talent.\n“Of course ping is bad but, unless we want to give up, unchangeable factor couldn’t be excuse,” CoreJJ said.\nIf NA wants to compete at Worlds and have a real shot at going far next year, maybe taking solo queue more seriously is the solution.", "meta": {}, "annotation_approver": null, "labels": [[0, 7, "PLAYER"], [40, 46, "GAME"], [94, 105, "ORG"], [146, 165, "PLAYER"], [205, 222, "GAME"], [310, 336, "TOURN"], [545, 552, "PLAYER"], [631, 638, "PLAYER"], [767, 771, "TOURN"], [791, 797, "TOURN"], [904, 910, "PLAYER"], [1188, 1194, "GAME"], [1522, 1526, "TOURN"], [2023, 2030, "PLAYER"], [2062, 2069, "TOURN"], [1538, 1547, "GAME"]]}
{"id": 382, "text": "Former Griffin player Lehends joins Hanwha Life\nLehends has joined CuVee and other new recruits on Hanhwa Life.\nLCK team Hanwha Life Esports has signed support player Son “Lehends” Si-Woo, the League of Legends team announced today. He’s part of Hanwha Life’s roster overhaul that includes 2017 world champion Lee “CuVee” Seong-Jin and four other players joining the team.\nLehends stepped onto the Challengers Korea stage in 2016 with SBENU Korea. In 2018, though, he joined Griffin ahead of their incredible first season in the LCK.\nGriffin missed Worlds 2018, but they qualified in 2019 and ended the season by dropping out in the group stage. Lehends and the other players then left Griffin last week.\nHanwha Life, on the other hand, had a lackluster 2018 season and came in last in the LCK Summer Split. They even had to battle to keep their spot in the 2020 LCK Promotion tournament, which they won.\nBut Hanwha Life won’t be the same in 2020. The organization signed CuVee, as well as former KT Rolster bot laner Jeon “Zenit” Tae-Gwon, jungler Kang “Haru” Min-Seung, mid Kang “Tempt” Myung-Gu, and support Oh “Vsta” Hyo-Seong. Mid laner Kim “Lava” Tae-Hoon is the only remaining player from Hanwha Life’s 2019 roster.", "meta": {}, "annotation_approver": null, "labels": [[7, 15, "ORG"], [22, 30, "PLAYER"], [35, 47, "ORG"], [48, 56, "PLAYER"], [67, 73, "PLAYER"], [99, 110, "ORG"], [112, 116, "TOURN"], [121, 140, "ORG"], [167, 187, "PLAYER"], [193, 210, "GAME"], [310, 331, "PLAYER"], [246, 257, "ORG"], [373, 380, "PLAYER"], [435, 446, "ORG"], [475, 483, "ORG"], [529, 532, "TOURN"], [549, 560, "TOURN"], [646, 654, "PLAYER"], [686, 694, "ORG"], [534, 542, "ORG"], [705, 716, "ORG"], [790, 806, "TOURN"], [858, 887, "TOURN"], [909, 920, "ORG"], [972, 977, "PLAYER"], [997, 1007, "ORG"], [1018, 1039, "PLAYER"], [1049, 1070, "PLAYER"], [1076, 1097, "PLAYER"], [1111, 1130, "PLAYER"], [1142, 1161, "PLAYER"], [1196, 1207, "ORG"]]}
{"id": 383, "text": "Former LCK team MVP has disbanded\nThe team was created in 2012.\nAfter falling back down to the Korean Challenger league in 2019, former LCK team MVP has decided to disband its League of Legends roster ahead of 2020.\nMVP joined the LCK in 2016 when the team qualified through the Summer Promotional tournament against Kongdoo Monster. That roster powered through five splits and peaked during the 2017 LCK Summer Split by finishing in fifth place.\nMVP’s roster remained exactly the same throughout their short stint in the LCK. Every single player ended up leaving, however, after the team failed to qualify for the LCK in 2018. That was the toughest year yet for MVP, with the team earning consecutive ninth-place finishes. The team competed in both the 2018 KeSPA Cup and the following year in the Korean Challenger league with a new roster but failed to find any success.\nMVP is one of many older Korean teams to have faltered or disbanded over the past couple of years. With an influx of new teams and younger players, a new era has effectively begun in the LCK. There’s plenty of talent flowing into the region and if some of these older teams lose a step or two, they could be replaced by the hottest new squads to hit the scene.\nMVP’s departure shows that the professional Korean scene is still one of the most competitive regions in terms of professional play. If an organization struggles for a split or two, another team can easily push it out of contention.", "meta": {}, "annotation_approver": null, "labels": [[7, 11, "TOURN"], [16, 20, "ORG"], [95, 119, "TOURN"], [136, 140, "TOURN"], [145, 149, "ORG"], [176, 193, "GAME"], [216, 220, "ORG"], [231, 235, "TOURN"], [279, 308, "TOURN"], [317, 332, "ORG"], [396, 417, "TOURN"], [447, 450, "ORG"], [522, 525, "TOURN"], [615, 619, "TOURN"], [663, 666, "ORG"], [754, 768, "TOURN"], [799, 823, "TOURN"], [874, 878, "ORG"], [1061, 1064, "TOURN"], [1235, 1241, "ORG"]]}
{"id": 384, "text": "Fnatic eliminated from Worlds 2019\nFans of the European team were hoping for a reverse sweep.\nFnatic were one loss away from going 0-3 against FunPlus Phoenix during their League of Legends World Championship quarterfinal series when Veigar was locked-in to keep Fnatic’s run alive. But it wasn’t enough to prevent the LEC’s second seed from ultimately falling to FPX.\nFnatic had their backs to the wall after swiftly dropping two games to FPX. Game three was Fnatic’s last chance at a final stand before heading home. Around 12 minutes in, FPX called in a teleport bot lane by Kim “Doinb” Tae-sang’s Ryze to secure a kill onto Fnatic’s duo. Tim “Nemesis” Lipovšek on Veigar countered with a teleport of his own and immediately placed his stun cage on top of Doinb. With nowhere to go and no one to follow up, Doinb vanished. Fnatic quickly turned to the rest of FPX and landed another kill onto Lin “Lwx” Wei-Xiang‘s Lucian giving Nemesis a double kill.\nNemesis continued his kill streak with another pick onto Doinb just a few moments later. With Veigar finding picks, Fnatic had the freedom to move about the map and quickly spiraled their lead. Throughout game three, Nemesis was untouchable thanks to Event Horizon and Fnatic’s tanky front line of Alistar and Ornn. FPX couldn’t respond fast enough as Fnatic trampled through their base to keep the series afloat.\nRelated: Fnatic lock-in Rengar against FPX at Worlds 2019—and drop game 1 of quarterfinal series\nIt appeared Fnatic had a chance to complete the reverse sweep after handing FPX a decisive loss, but this was not the case. FPX promptly banned Veigar and locked in an incredibly safe team composition with Tahm Kench and Varus bot lane. No matter how hard Fnatic tried, they failed to find leads. Lin “Lwx” Wei-Xiang on Varus was constantly catching Fnatic out with his ultimate and FPX ensured Gabriël “Bwipo” Rau on Kayle couldn’t scale.\nEven though Fnatic’s journey ends here, their LEC counterparts, Splyce and G2 Esports, will play tomorrow to keep the region in Worlds contention. FPX, on the other hand, appear to have gotten over their hiccups during the group stage. The LPL team who had a 35-6 win loss record during the Summer Split showed up today. Despite dropping one game, FPX proved to be the better team with three incredibly one-sided games against Fnatic. And Doinb, in particular, looks to be on an entirely different level.\nNext week FPX will face their fellow LPL representative and reigning World Champions, Invictus Gaming in the semifinals. FPX have beaten IG before, but will their dominance thus far be enough to carry them to the finals?", "meta": {}, "annotation_approver": null, "labels": [[0, 7, "ORG"], [23, 34, "TOURN"], [94, 101, "ORG"], [143, 158, "ORG"], [172, 208, "TOURN"], [263, 269, "ORG"], [318, 322, "TOURN"], [364, 367, "ORG"], [369, 376, "ORG"], [440, 443, "ORG"], [460, 466, "ORG"], [541, 545, "ORG"], [578, 598, "PLAYER"], [628, 634, "ORG"], [642, 664, "PLAYER"], [759, 764, "PLAYER"], [810, 816, "PLAYER"], [826, 833, "ORG"], [863, 867, "ORG"], [896, 915, "PLAYER"], [932, 940, "PLAYER"], [955, 963, "PLAYER"], [1012, 1018, "PLAYER"], [1071, 1078, "ORG"], [1172, 1180, "PLAYER"], [1224, 1230, "ORG"], [1271, 1274, "ORG"], [1307, 1314, "ORG"], [1378, 1385, "ORG"], [1408, 1412, "ORG"], [1478, 1485, "ORG"], [1542, 1546, "ORG"], [1590, 1594, "ORG"], [1722, 1729, "ORG"], [1763, 1782, "PLAYER"], [1816, 1822, "ORG"], [1849, 1853, "ORG"], [1861, 1880, "PLAYER"], [1918, 1924, "ORG"], [1952, 1956, "TOURN"], [1970, 1976, "ORG"], [1981, 1991, "ORG"], [2053, 2056, "ORG"], [2146, 2150, "TOURN"], [2254, 2258, "ORG"], [2333, 2339, "ORG"], [2345, 2350, "PLAYER"], [2421, 2425, "ORG"], [2448, 2452, "TOURN"], [2497, 2512, "ORG"], [2532, 2536, "ORG"], [2548, 2551, "ORG"], [601, 606, "AVATAR"], [668, 675, "AVATAR"], [918, 925, "AVATAR"], [1049, 1056, "AVATAR"], [1253, 1260, "AVATAR"], [1265, 1269, "AVATAR"], [1393, 1400, "AVATAR"], [1610, 1617, "AVATAR"], [1672, 1682, "AVATAR"], [1687, 1693, "AVATAR"], [1786, 1792, "AVATAR"], [1884, 1890, "AVATAR"], [2197, 2209, "TOURN"]]}
{"id": 385, "text": "Will DAMWON Gaming end G2’s Worlds 2019 run?\nG2 can’t expect to cruise through Worlds anymore.\nG2 Esports were one game away from becoming the first European team to go 6-0 during the League of Legends World Championship group stage when Griffin dismantled them.\nG2 were sweeping through the competition. Their matches against Cloud9 and Hong Kong Attitude looked all too easy. It was clear G2 were leagues ahead. But against Griffin, G2 appeared to be caught off guard. Griffin relentlessly took over the early game in their rematch and tiebreaker.\nWhile G2 were breezing through their opponents, Griffin were ramping up for a first-place finish. And much like Griffin, DAMWON Gaming slowly rose to the top of their respective group. DAMWON showed significant holes in their early game throughout the play-in stage, but they sorted out this weakness as they progressed through groups to secure the first seed at 5-1. G2 should know that they can’t skate by their competition anymore, but will they learn this in time for their quarterfinal match against DAMWON?\nTime to refocus\nG2 may have faltered near the end of the group stage, but that doesn’t take away from the dominance they’ve shown throughout the year. The reigning MSI champions strolled through the Worlds group stage for a reason.\nThey have five of the best individual players in the LEC. They’ve shown incredible versatility largely thanks to their bot laner Luka “Perkz” Perković and his champion pool. Since he started off as G2’s mid laner, Perkz has become versed in playing mages and other mid champions like Yasuo. This has allowed G2 to experiment and succeed with unique bot lanes like Zoe plus Rakan or Pyke and Yuumi.\nThroughout the year, Perkz has learned how to play traditional ADCs as well, so G2 doesn’t have to rely on interesting picks to win. With Perkz on a typical marksman, G2 can play a standard back-to-front game and win. We’ve already seen this at Worlds in their first match against Griffin and Cloud9.\nUnfortunately for G2, Perkz’s ability to play anything likely won’t be a determining factor in their series against DAMWON. Non-traditional bot lanes—mage lanes in particular—have had a poor win rate with a 1-13 record over the course of the group stage. And traditional ADCs like Xayah and Kai’Sa are still preferred due to their consistent damage and siege capability.\nAdditionally, the Worlds meta has revolved around supports and junglers generating leads rather than ADCs. While Perkz is more than capable of performing, the onus will be on Marcin “Jankos” Jankowski and Mihael “Mikyx” Mehle to roam and build leads for G2. In G2’s loss against Griffin, Lee “Tarzan” Seung-yong completely outpathed G2. Griffin’s support, Son “Lehends” Si-woo, was seen everywhere from top to bot lane. The pressure brought by Tarzan and Lehends enabled the rest of Griffin to easily follow up on any engages, which ultimately led to G2’s defeat.\nLuckily for G2, DAMWON’s strength doesn’t come from their jungler, but rather their mid and top laners. G2 also have the advantage as Worlds veterans and as the reigning MSI champions.\nFirst time LCK, first time Worlds\nThis isn’t just DAMWON’s first Worlds appearance. It’s also their first year in the LCK.\nDAMWON rose through the Korean challenger league and beat out long-standing teams like KT Rolster and Afreeca Freecs to earn the region’s third seed at Worlds. DAMWON’s star power comes from their solo laners Jang “Nuguri” Ha-gwon and Heo “ShowMaker” Su.\nThey’ve become absolute lane bullies in the LCK. Nuguri isn’t afraid of taking aggressive builds, like Kleptomancy Vladimir with Cull as his starting item, even in unfavorable matchups. And ShowMaker has shown up time and time again to clean up after DAMWON’s engages. He’s been a reliable source of damage and carry threat throughout Worlds thus far.\nAlthough DAMWON are new to Worlds, they still have an impeccable record. They went undefeated in the play-in group stage and finished with a 5-1 record coming out of groups. Their record, however, should be taken with a grain of salt. During the play-in stage, they lost nearly every early game. They lacked proactivity, which left them struggling against teams like Lowkey Esports. Moving into the main stage, DAMWON still struggled early. But they seem to have improved on this weakness throughout the tournament. In their rematch against Invictus Gaming, DAMWON were playing around their vision to respond to any early aggression by IG while using Kim “Canyon” Geon-bu to set up plays of their own.\nDAMWON’s rise to the quarterfinals wasn’t as painless as G2’s, but they’ve clearly shown improvements throughout the competition. The extra week DAMWON had in the play-in stage assumedly helped them become acclimated to the stage and current meta, which could be the advantage G2 are missing coming into their series.\nG2 will face DAMWON in a best-of-five series on Sunday, Oct. 27 at 11am CT for a chance to advance to the Worlds semifinals.", "meta": {}, "annotation_approver": null, "labels": [[5, 18, "ORG"], [23, 25, "ORG"], [28, 39, "TOURN"], [45, 47, "ORG"], [79, 86, "TOURN"], [95, 105, "ORG"], [184, 220, "TOURN"], [238, 245, "ORG"], [263, 266, "ORG"], [327, 334, "ORG"], [338, 356, "ORG"], [391, 394, "ORG"], [426, 433, "ORG"], [435, 438, "ORG"], [471, 479, "ORG"], [556, 559, "ORG"], [598, 606, "ORG"], [662, 669, "ORG"], [671, 684, "ORG"], [735, 741, "ORG"], [918, 921, "ORG"], [1055, 1061, "ORG"], [1079, 1082, "ORG"], [1227, 1231, "TOURN"], [1258, 1268, "TOURN"], [1348, 1351, "TOURN"], [1424, 1445, "PLAYER"], [1493, 1495, "ORG"], [1509, 1515, "PLAYER"], [1603, 1606, "ORG"], [1714, 1720, "PLAYER"], [1773, 1776, "ORG"], [1831, 1837, "PLAYER"], [1860, 1862, "ORG"], [1938, 1944, "TOURN"], [1974, 1982, "ORG"], [1986, 1992, "ORG"], [2012, 2014, "ORG"], [2016, 2024, "PLAYER"], [2110, 2116, "ORG"], [2379, 2389, "TOURN"], [2478, 2484, "PLAYER"], [2540, 2565, "PLAYER"], [2570, 2590, "PLAYER"], [2619, 2621, "ORG"], [2626, 2628, "ORG"], [2644, 2651, "ORG"], [2652, 2676, "PLAYER"], [2698, 2700, "ORG"], [2702, 2709, "ORG"], [2721, 2741, "PLAYER"], [2809, 2815, "PLAYER"], [2820, 2828, "PLAYER"], [2848, 2856, "ORG"], [2916, 2918, "ORG"], [2941, 2943, "ORG"], [2945, 2951, "ORG"], [3033, 3036, "ORG"], [3063, 3069, "TOURN"], [3099, 3102, "TOURN"], [3125, 3128, "TOURN"], [3141, 3148, "TOURN"], [3164, 3170, "ORG"], [3179, 3185, "TOURN"], [3232, 3235, "TOURN"], [3237, 3243, "ORG"], [3261, 3285, "TOURN"], [3324, 3334, "ORG"], [3339, 3353, "ORG"], [3397, 3403, "ORG"], [3446, 3467, "PLAYER"], [3472, 3490, "PLAYER"], [3536, 3539, "TOURN"], [3541, 3548, "PLAYER"], [3743, 3749, "ORG"], [3827, 3833, "TOURN"], [3853, 3859, "ORG"], [3871, 3877, "TOURN"], [4211, 4225, "ORG"], [4255, 4262, "ORG"], [4385, 4400, "ORG"], [4402, 4408, "ORG"], [4480, 4482, "ORG"], [4494, 4515, "PLAYER"], [4546, 4552, "ORG"], [4603, 4605, "ORG"], [4691, 4697, "ORG"], [4823, 4825, "ORG"], [4864, 4866, "ORG"], [4877, 4883, "ORG"], [4966, 4976, "TOURN"], [1659, 1663, "AVATAR"], [1668, 1674, "AVATAR"], [1677, 1682, "AVATAR"], [1686, 1691, "AVATAR"], [2275, 2281, "AVATAR"], [2285, 2291, "AVATAR"], [3389, 3395, "TOURN"]]}
{"id": 386, "text": "Invictus Gaming qualify for Worlds 2019 semifinals after defeating Griffin in 4 games\nThe reigning World Champions are here to stay.\nWhen you come at the king, you best not miss. Invictus Gaming have locked in their spot for the next round of the League of Legends 2019 World Championship after taking down Korea’s Griffin in the tournament’s quarterfinals.\nA lot of this victory rested on the shoulders of IG’s top laner, Kang “TheShy” Seung-lok, who outright destroyed Choi “Sword” Sung-won in every single matchup. He stomped the competition, playing Kayle like no one we’ve ever seen before. TheShy even had seven solo kills and a commanding 4.6 KDA to boot.\nOn the other hand, there are plenty of question marks surrounding Griffin and their gameplan for this series. For example, the team put talented mid laner Jeong “Chovy” Ji-hoon on tank duty for all four games against Song “Rookie” Eui-jin. This is the same Chovy who challenged some of the best mids in the LCK.\nAs a result, fans should expect some adjustments to Griffin for the next year. Griffin have an extremely talented set of players—but when you’ve only won a single best-of-five series throughout an entire year, it’s clear that changes need to be made.\nIG, on the other hand, have shown the rest of the world that they are back in championship form. From TheShy looking extremely confident to Yu “JackeyLove” Wen-Bo breaking out the Kog’Maw in the first game of the series, this team looks poised to make a run for back-to-back Summoner’s Cup wins.", "meta": {}, "annotation_approver": null, "labels": [[0, 15, "ORG"], [28, 39, "TOURN"], [67, 75, "ORG"], [179, 194, "ORG"], [247, 288, "TOURN"], [315, 323, "ORG"], [423, 446, "PLAYER"], [471, 492, "PLAYER"], [596, 602, "PLAYER"], [729, 737, "ORG"], [818, 839, "ORG"], [880, 901, "PLAYER"], [970, 973, "TOURN"], [1027, 1035, "ORG"], [1054, 1062, "ORG"], [1226, 1228, "ORG"], [1328, 1334, "PLAYER"], [1366, 1388, "PLAYER"], [554, 559, "AVATAR"], [920, 926, "PLAYER"], [1406, 1414, "AVATAR"]]}
{"id": 431, "text": "Conferences and Divisions\nWith teams playing matches in their home cities, we’re breaking the 20 teams into two conferences, with two divisions in each conference.\nEach team will play 28 total regular-season matches, which includes two matches against each in-conference opponent and one match against all out-of-conference teams. The regular season will consist of 26 weeks—with all matches played over weekends—and will include a break for All-Stars and a midseason tournament between Weeks 12 and 13.\nEach team will host at least two home weekend events during the season, with an additional 12 events—three per division—collectively hosted by teams in their home territories. Tickets are now available for most of those events, and additional location and ticketing information will be released soon.\nMatch Structure\nNew in 2020, teams will play regular-season matches in a first-to-three format. Each match will open with control, and then teams will play hybrid, assault, and escort in an order that rotates across matches to ensure they are played evenly throughout the season. If a match reaches the fifth map, only control maps will be played until a team gets to three map wins. After every two maps played, teams will get a quick break to strategize.\nMap Pools and Patches\nIn order to keep the map variety fresh, we’ll be changing out the map pool four times during the season. All control maps will be in play throughout the entire season and each map pool will feature three maps from each of the other game modes. A new map pool will be used for the postseason.\nThroughout the season, we expect Overwatch to receive several game patches. Overwatch League matches will take place on the most updated patch, but the rollout of those patches will be somewhat delayed from the actual game to the Overwatch League to ensure we’re able to properly deploy them and provide teams a window to practice on the new patch before they are asked to compete on it.\nAll-Stars and Midseason Tournament\nAfter Week 12 of the season we’ll take a break for All-Stars festivities—and a new midseason tournament. All-Stars will feature the league’s best players competing in a series of fun game modes. We’re also planning some 1v1 action and another Talent Takedown. Stay tuned for more details. These All-Stars events will have a total prize pool of US $250K, so there’s more than just bragging rights on the line in 2020.\nThe midseason tournament will feature the top four teams in the league: the top team from each conference and the next best two teams by record from either conference. In order to manage logistical requirements for teams around the world, the teams will qualify based on their record over their first nine matches in the 2020 season. Those teams will play in a single-elimination bracket, with the top seed picking their opening-round opponent.\nPostseason\nThe 2019 postseason was epic, and we heard positive feedback on the format from our players and our fans. The 2020 postseason format is similar to 2019, with a play-in tournament followed by double-elimination bracket play culminating in the 2020 Grand Finals. The seventh- through 12th-seeded teams in the standings will qualify for the play-in tournament.\nThe double-elimination bracket will feature the following eight teams:\nThe two top teams per conference as the top seeds (as determined by record with map differential as the tiebreaker)\nThe next four teams across both conferences as the three to six seeds\nThe two teams that advance from the play-in tournament as the seven and eight seeds\nWe’ll share more details about the postseason as the season progresses.\nPrize Pools\nMidseason Tournament\nFirst place—$500K\nSecond place—$250K\nThird place—$150K\nFourth place—$150K\nAll-Stars\nTotal prize pool—$250K\nSeason Playoffs\nFirst place—$1.5M\nSecond place—$800K\nThird place—$500K\nFourth place—$300K\nFifth place—$200K\nSixth place —$200K\nSeventh place—$100K\nEighth place—$100K\nTo get the latest Overwatch League news and content, follow us on Twitter at @overwatchleague, and sign up for our newsletter here.", "meta": {}, "annotation_approver": null, "labels": [[458, 478, "TOURN"], [442, 451, "TOURN"], [1609, 1618, "GAME"], [1652, 1676, "TOURN"], [1806, 1822, "TOURN"], [1964, 1973, "TOURN"], [1977, 1999, "TOURN"], [2242, 2257, "TOURN"], [2875, 2891, "TOURN"], [2982, 2997, "TOURN"], [3114, 3131, "TOURN"], [3210, 3228, "TOURN"], [3655, 3675, "TOURN"], [3967, 3983, "TOURN"]]}
{"id": 432, "text": "Jong-Ryeol “Saebyeolbe” Park (Excelsior): “With my wife in Korea—and BB.”\nMin-Ki “Viol2t” Park (Shock): “I went out to play or see my old friends, and I am practicing games steadily. I have a plan to travel in the future.”\nJeong-Woo “Sayaplayer” Ha (Mayhem): “I'm streaming Overwatch a lot, and playing a lot of comp. I exercise and play other games in my spare time.”\nDong-Gyu “Mano” Kim (Excelsior): “I’m spending most of my time hanging out or traveling with my friends because I like to go outside rather than stay inside.”\nGabriel “Swimmer” Levy (Uprising): “Most likely will be spending it with my team, but might possibly visit some family nearby.”\nHae-Seong “Libero” Kim (Excelsior): “Boxing and playing Overwatch.”\nCorey “Corey” Nigra (Justice): “Spending time with family for some holidays and planning to spend a holiday with the team!”\nWalid “Mouffin” Bassal (Uprising): “Honestly, I don’t really celebrate holidays? I come from a very Arab family and we really don’t celebrate any of these holidays. We do put up a Christmas tree for Christmas but that's pretty much it. I'm looking forward to celebrating a lot of holidays for the first time with others in the future though!”\nTae-Sung “Anamo” Jung (Excelsior): “Meet friends, go to the hospital for health, play other games, sleep.”\nMin-Hyuk “Michelle” Choi (Dynasty): “I’m not doing much, but just playing games all day long.”\nIndy “Space” Halpern (Gladiators): “With my family in New York and Los Angeles. Mainly taking a big break away from the computer and spending time with others.”\nKelsey “Colourhex” Birse (Uprising): “With my family in New Zealand.”\nJe-Min “Illicit” Park (Dynasty): “I’m resting a lot and trying not to get stressed out.”\nCharlie “Nero” Zwarg (Charge): “I’m spending it with my family because I know I won’t be able to a lot next year.”\nSeong-Hyun “Jjonak” Bang (Excelsior): “I want to go out and eat lots of delicious things and see lots of fun things.”\nNolan “Paintbrush” Edwards (Gladiators): “I am spending Thanksgiving with my girlfriend’s family. I met her father once before, but this will be the first time that I [can] really spend serious time with him. I hope to be able to spend Christmas/New Year’s with family and friends. Christmas is my favorite time of year and is very important to me that I spend it with others. If I am unable to return home, I will get a group of friends together in LA to have some fun! Apply, Shax, and Reprize should be in the area still, unless they decide to go home. I hold all three of them close to my heart from our time on Mayhem Academy.”\nDaniel “Boink” Pence (Outlaws): “I plan on going home and visiting my family. Nothing too special, but I haven’t been home in a long time, so it should be a good time.”\nYeon-Jun “Ark” Hong (Justice): “Just having hot tub, rest.”", "meta": {}, "annotation_approver": null, "labels": [[0, 29, "PLAYER"], [74, 94, "PLAYER"], [30, 39, "ORG"], [96, 101, "ORG"], [223, 248, "PLAYER"], [250, 256, "ORG"], [274, 283, "GAME"], [369, 388, "PLAYER"], [390, 399, "ORG"], [528, 550, "PLAYER"], [552, 560, "ORG"], [656, 678, "PLAYER"], [680, 689, "ORG"], [712, 721, "GAME"], [724, 743, "PLAYER"], [745, 752, "ORG"], [848, 871, "PLAYER"], [872, 880, "ORG"], [1191, 1212, "PLAYER"], [1214, 1223, "ORG"], [1298, 1323, "PLAYER"], [1324, 1331, "ORG"], [1393, 1414, "PLAYER"], [1415, 1425, "ORG"], [1554, 1578, "PLAYER"], [1580, 1588, "ORG"], [1624, 1645, "PLAYER"], [1647, 1654, "ORG"], [1713, 1733, "PLAYER"], [1735, 1741, "ORG"], [1828, 1852, "PLAYER"], [1854, 1863, "ORG"], [1946, 1972, "PLAYER"], [1974, 1984, "ORG"], [2579, 2599, "PLAYER"], [2601, 2608, "ORG"], [2748, 2767, "PLAYER"], [2769, 2776, "ORG"], [2417, 2422, "PLAYER"], [2424, 2428, "PLAYER"], [2434, 2442, "PLAYER"], [2562, 2576, "ORG"]]}
{"id": 433, "text": "The Overwatch Contenders program has been vital in the growth of competitive Overwatch talent from all over the world. We’ve seen former Contenders players from regions such as Australia, North America, South America, South Korea, China, and Europe rise into the Overwatch League with incredible success. However, we are always looking to improve. With the Overwatch League moving to a home-and-away structure in 2020, and after listening to feedback from the community, we will be making some changes that will continue to surface up-and-coming talent, provide players with more opportunities to compete, and will hopefully be easier to follow for all you Contenders fans out there.\nThe first major change we will be making is to the format. First, we’ll be splitting the regions into two conferences in a way you will probably recognize—Atlantic (Europe, North America, South America) and Pacific (Australia, China, Korea, Pacific). We’ll also be moving away from the traditional league structure we’ve been using historically in Contenders and move to a bi-weekly tournament series, where teams will be able to accumulate points that will ultimately qualify them into a regional playoff series. We will be moving Contenders Trials to a bi-weekly cycle also, to give more opportunities for Open Division teams to break through.\nBut first, we’ll have to transition.\nWhat will the transition look like?\nIn early 2020 we will invite all 2019 Season 2 Contenders teams to a preliminary double-elimination tournament, which will determine seeding into the new system. The top four will receive byes into their region’s first Contenders tournament quarterfinals as seeds 1 though 4, and the bottom four will receive byes into their region’s first Contenders Trials tournament as seeds 1 through 4. This will only need to be played out once, as it’s simply a transitional tournament to seed fairly into the 2020 structure.\nWhat will a season in 2020 look like?\nPhase 1: A season will first begin with Open Division for each region, open to all players of all skill levels (not including Contenders players). This will run for seven weeks—six weeks of Swiss into a week of Playoffs—to produce the top 8 teams that will compete in Contenders Trials.\nPhase 2: Contenders Trials will take place over one week, where 12 teams (bottom 4 from Contenders, top 8 from Open Division) will compete in a single-elimination bracket.\nPhase 3: This is where the first of the Contenders bi-weekly tournaments will take place, alternating week-to-week between the Atlantic and Pacific divisions. 12 teams—the top 4 Contenders teams and top 8 Contenders Trials teams—will compete in a single-elimination bracket. This is where points will be awarded for the region’s playoffs. The top four teams will retain their auto-qualification into the next Contenders tournament, which will take place two weeks later, while the bottom eight will compete in Contenders Trials the following week.\nPhase 4: Repeat phases 2 and 3 for Contenders Trials Week 2, then Contenders Week 2.\nPhase 5: Repeat phases 1 through 4. When it’s all over, the top 8 teams with the most points will secure their spot in their regional playoffs.\nPhase 6: The top 8 teams will compete in a double-elimination regional playoff tournament to determine their region’s Contenders champion.\nThere will be two full seasons of Contenders in 2020, producing two championship-winning teams per region.\nWhat about Showdowns and the Contenders Gauntlet, are they returning in 2020?\nThey are! Teams that perform well in their regional tournaments may qualify for these international live events. We will have more details to share on those at a later date.\nWhat about prize money/LANs/other thing you didn’t mention in this blog?\nWe will be sharing more details about all of the above as we get closer to the first 2020 season. Until then, be sure to follow us at @owpathtopro to stay up to date with all things path to pro!", "meta": {}, "annotation_approver": null, "labels": [[263, 279, "TOURN"], [357, 373, "TOURN"], [1472, 1513, "TOURN"], [3449, 3458, "ORG"], [3467, 3486, "ORG"], [4, 14, "GAME"], [77, 87, "GAME"], [1622, 1644, "TOURN"], [1743, 1771, "TOURN"], [2455, 2487, "TOURN"], [2224, 2241, "TOURN"], [2252, 2269, "TOURN"], [2824, 2845, "TOURN"], [2925, 2942, "TOURN"]]}
{"id": 434, "text": "Seoul, South Korea—Saturday was one of those days that felt like it would go on forever, but no one inside OGN Giga Arena—not the players, nor the casters, nor the fans—would’ve minded. Four thrilling matches whittled down the Contenders Gauntlet field in half while ramping up the excitement for Sunday’s finale.\nIn between two speedruns from ATL Academy, who eliminated XL2 and Gen.G with clean 3-0 sweeps, the second and third matches provided blockbuster entertainment for a full house. First, Gen.G defeated Talon Esports 3-2 in a meaty appetizer for the winner’s final. After a decisive Gen.G win on Busan, the two teams played the next three maps extremely close. King’s Row was decided in time bank, Paris went two extra rounds, and Route 66 was a chess match of team comp changes and strategic maneuvers that went down to the wire. In the end, Gen.G showed more composure and clutch ability on control maps (including a miraculous Lúcio stall by 14-year-old support So-Myung “Bliss” Kim on Lijiang Tower Garden), and were able to keep Talon’s Patiphan “Patiphan” Chaiwong at bay.\nAt the end of the match, Patiphan sprung up out of his seat and hugged first Bo-Hyun “Bashful” Kang, who was sitting to his right, then Ji-Yoon “Gogora” Lee, sitting to his left—it was hard to tell from his body language that his team had just lost, and maybe, in a way, they didn’t. Despite not making it to the final day of the competition, the Pacific champions achieved a lot more than their in-game results; they earned significant recognition from an appreciative Korean crowd while proving their mettle, both individual and collective, against fierce international competition.\nThe pinnacle of Saturday’s schedule was the winner’s final between Element Mystic and RunAway, a rematch of the Contenders Korea Season 2 Grand Final that somehow managed to surpass expectations. After six hotly contested maps, Element Mystic emerged victorious, securing their spot in Sunday’s Gauntlet Finals.\nJudging from the previous day’s results, RunAway should’ve been heavy favorites going in—they were barely tested in a 3-0 win over Gen.G, while Element Mystic looked shaky in an eventual 3-2 win over ATL Academy. But it was Element Mystic who surged out of the gates, building a 2-0 lead. But this RunAway roster is well-known for their mental fortitude, and they returned after the break with an unexpected Symmetra-Hanzo attack comp on Horizon Lunar Colony before full-holding Element Mystic with a scary Bastion defense and Nam-Jin “Gangnamjin” Gang’s superb Ana play.\nThroughout the match, the two teams went blow for blow, with dozens of micro-battles swaying the tides in every single map. Dong-Ha “Doha” Kim’s Sombra tested RunAway early, Hee-Su “Heesu” Jeong earned massive style points with his Widowmaker play on Ilios, and dazzling Pharmercy battles starring Jun-Ki “Yaki” Kim and Yeong-Han “Sp9rk1e” Kim defined maps like Eichenwalde and Dorado. In the end, Element Mystic benefitted from slightly better team coordination and ult management and pulled ahead of their longtime domestic rivals.\n“We’ve pretty much seen all of the comps that Runaway brought out today in scrims,” Doha said after the match. “The only thing that was surprising was their Hanzo pick on Horizon Lunar Colony, and I still don’t really understand the reasoning for that—I assume they just wanted to play Hanzo. Overall, I don’t think anything really surprised us. Rather, we simply didn’t adjust well on the maps that we lost.”\nWhat’s obvious is that these are two teams that not only know each other very well, but bring out the best in each other in competition, and Doha wasn’t alone in expressing his desire for a rematch in the Final. But first, RunAway will have to get past ATL Academy in the loser’s final first thing Sunday.\nNA’s last remaining team didn’t want to give away any strategic notes they had on RunAway, but the confidence was sky-high following a pair of breezy wins on Saturday.\n“Every day we’re just leveling up more and more,” coach Dillain “LegitRc” Odeneal said. “At the end of the day it doesn’t matter how equal the teams are going into the tournament, it’s about how quickly you adapt to the situation and environment around you. I think we’re adapting quicker and better than other teams.”\nATL Academy and RunAway face off at noon KST (8 p.m. PT, Oct. 12), with the winner moving on to face Element Mystic in the Gauntlet Final right after. Watch the thrilling conclusion to the Overwatch Contenders season live on Twitch!", "meta": {}, "annotation_approver": null, "labels": [[227, 246, "ORG"], [344, 355, "ORG"], [372, 375, "ORG"], [380, 385, "ORG"], [498, 504, "ORG"], [512, 527, "ORG"], [593, 599, "ORG"], [606, 611, "ORG"], [853, 859, "ORG"], [975, 995, "PLAYER"], [1044, 1081, "PLAYER"], [1114, 1122, "PLAYER"], [1166, 1188, "PLAYER"], [1760, 1767, "ORG"], [1741, 1755, "ORG"], [1902, 1916, "ORG"], [2027, 2034, "ORG"], [2117, 2122, "ORG"], [2130, 2145, "ORG"], [2186, 2197, "ORG"], [2210, 2224, "ORG"], [2284, 2291, "ORG"], [2465, 2479, "ORG"], [2513, 2538, "PLAYER"], [2682, 2709, "PLAYER"], [2717, 2724, "ORG"], [2732, 2752, "PLAYER"], [2856, 2874, "PLAYER"], [2878, 2901, "PLAYER"], [2956, 2971, "ORG"], [3176, 3180, "PLAYER"], [3643, 3647, "PLAYER"], [3725, 3732, "ORG"], [3755, 3766, "ORG"], [3890, 3897, "ORG"], [4032, 4057, "PLAYER"], [4295, 4306, "ORG"], [4311, 4318, "ORG"], [4396, 4410, "ORG"], [4484, 4511, "TOURN"], [940, 946, "AVATAR"], [1225, 1245, "PLAYER"], [1786, 1812, "TOURN"], [2403, 2408, "AVATAR"], [2394, 2402, "AVATAR"], [2548, 2552, "AVATAR"], [2790, 2801, "AVATAR"], [3249, 3255, "AVATAR"], [3378, 3383, "AVATAR"], [4418, 4426, "TOURN"], [1969, 1978, "TOURN"]]}
{"id": 435, "text": "When Shane “Rawkus” Flaherty walked into the press conference area late Saturday evening, the haze of triumph in the air was still fresh. He and his Team USA teammates settled into their seats, two golden trophies exuberantly smudged by fingerprints set on the table like conspicuous dining table centerpieces. And then, suddenly, the fog was broken.\n“Last time I was here was when I lost,” he said. “I was just sitting here feeling depressed!”\nIf only the Rawkus from last BlizzCon could see him now: an Overwatch World Cup gold medalist, part of a Team USA roster that will go down in history as the first to break South Korea’s stronghold on the tournament.\n“It feels so good, actually, to finally do it,” he said. “I don’t even have words to explain how I feel right now, it was something that I wanted to do no matter what. I wanted to finally get the win after doing so bad the last two years.”\nLet’s talk about those last two years. In 2017, Team USA, sparked by a 17-year-old Tracer one-trick named Jay “Sinatraa” Won, gave the reigning champions a scare in the quarterfinals by pushing them to five maps, but ultimately lost 3-1. In 2018, beating South Korea was the implicit goal, but they never got that far, dumped again in the quarterfinals by the United Kingdom. (Notably, the Americans also lost in the quarterfinals of the very first OWWC in 2016, again to South Korea.)\nThis year, 2019, would be different.\n“Last year we just thought as players, as everybody, we thought we would only have to worry about Korea, so we only reviewed for Korea,” Sinatraa said. “But this year we reviewed literally every possible team that we could play and every map, every comp, everything about them.”\nFriday’s group-stage results stand as proof of their amped-up preparations, as Team USA summarily dispatched France, Sweden, the UK, and South Korea—four countries with wholly different playstyles: 3-0, 3-0, 3-0, 3-0. On Saturday, their opponent in the gold-medal match, China, theoretically should have posed a fresh set of problems. They didn’t: 3-0.\nSo when off-tank Indy “Space” Halpern said onstage that the team’s victory was entirely expected, he wasn’t being flippant, but rather affirming the sheer amount of work that went into this year’s tournament. If every single possibility was truly accounted for, then why should there be any surprises?\nIn order to break out of history, though, first the team had to practice selective amnesia.\n“We didn’t really worry about previous years, we never talked about it, we didn’t ever mention it, didn’t ever think about it because we just wanted to focus on what was ahead,” Sinatraa said.\nThose last two years of disappointment? It’s like they never happened. If that sounds like an impossible task, consider that half of Team USA’s starting lineup was plucked from the San Francisco Shock roster. Yes, the same one that lost their opening match of the 2019 playoffs, then didn’t drop another map for the rest of their march to the Overwatch League trophy. Even when they felt in their bones that they were destined for a championship, they chose the mindset of underdogs (and knocked on a lot of wood, for good measure).\nSouth Korea may have claimed two other Shock players, plus head coach Dae-Hee “Crusty” Park, but Team USA embraced the very spirit of the team. They focused. They brought clear heads to each match. At the same time, they kept loose and enjoyed each other’s company—there was even a special handshake, albeit one that Kyle “KSF” Frandanisa was allegedly left out of due to a “really weird pinky.”\n“The synergy’s there, the trust in each other’s there, and that’s what made Shock really strong, and it’s the same thing here,” support Grant “Moth” Espe said.\nThe Shock synergy was evident even in those supposed grudge matches against South Korea, which pitted Sinatraa, Moth, and Super against Crusty, Hyo-Bin “Choihyobin” Choi, and Min-Ho “Architect” Park, as demonstrated by the warm embraces shared by the Overwatch League teammates both onstage and offstage—there was a lot of hugging, by all accounts.\nThat’s part of the beauty of the Overwatch World Cup. It was always meant as a celebration of global talent rather than pitched battle—at least not to the degree of the league, with its massive prize pool and constant stoking of rivalries.\nThat’s why, despite the disappointment of not being able to bring home another gold medal, main tank Dong-Gyu “Mano” Kim was able to take a wider perspective on the experience.\n“Before coming to the Overwatch World Cup, I thought that if Korea were to lose, we’d have a lot of regrets,” he explained. “After playing all of these matches and getting bronze, though, I don’t have any regrets. I’m thankful that I got to meet a lot of really talented players, the coaching staff and everyone on Team South Korea. Getting close with all of these players was a big gift for me. Also, I want to tell all the first-timers here at the World Cup—of course we wanted to win a gold medal, but don’t beat yourself up too much. Just let it go and focus on elevating yourselves for the 2020 Overwatch League season.”\nHere, there’s a prevailing sense of camaraderie and discovery, and this year, with the expanded field all congregating at BlizzCon, the reach of Overwatch esports was truly on display. We had the usual participants, of course, but we also saw teams from Saudi Arabia, South Africa, India, and Singapore. The flag ceremony before Saturday’s matches was longer and more colorful than it has ever been in previous years.\nDenmark and the Netherlands, previously impressive in group stages but never beyond, finally made it to the BlizzCon stage, and once they arrived, they blossomed under the big lights. Denmark forced two draws against mighty South Korea, while the Netherlands took a map off perennial podium threat France. And despite being a mainstay in the medal rounds, this year France debuted a mostly new roster that was largely untested on the big stage.\nIt was a valuable reminder that new generations of Overwatch talent are constantly emerging, and the Overwatch World Cup is often the place where they first become known to the world.\nTwo years ago, Sinatraa was one of them. Now, at 19, he’s just completed a double-MVP season, claiming the honors for both the Overwatch League regular season and the Overwatch World Cup—the same set completed by Seong-Hyun “Jjonak” Bang did last year. He, Moth, and Super also became the second, third, and fourth players to win both an Overwatch League title and the Overwatch World Cup, after Jun-Ho “Fury” Kim.\nIt’s not that Team USA’s victory represents some massive sea change in the cosmology of Overwatch esports. Rather, it feels like 2019 is a fated year for this specific group of players. Sinatraa, as he confirmed onstage with no small amount of bemusement, is the best player in the world right now, and Moth and Super have been with him the entire ride. And with dynamic teammates like Space, Rawkus, and Corey “Corey” Nigra, it seemed inevitable that a team would take on Sinatraa’s most distinctive in-game trait—unbridled aggression—and run with it all the way to a gold medal.\nNo other team right now has the creative vision to bust out a team comp featuring Genji, Symmetra, and Reinhardt, or the confidence to do it on a fifth map against the three-time Overwatch World Cup champions. Or the right frame of mind to execute it, according to Space.\n“I’m pretty sure two or three teams tried to steal that strat, but nobody could execute it because they weren’t going aggressive like we were,” he said. “It was pretty funny to see, like, after we beat everybody [in scrims] with that strat, everyone just trying to copy it.”\nWhat’s the old saying? If you can’t beat ’em, join ’em. This year, no one could beat Team USA.", "meta": {}, "annotation_approver": null, "labels": [[4, 28, "PLAYER"], [457, 463, "PLAYER"], [505, 524, "TOURN"], [474, 482, "TOURN"], [1007, 1025, "PLAYER"], [1561, 1569, "PLAYER"], [2073, 2093, "PLAYER"], [2628, 2636, "PLAYER"], [2985, 3002, "TOURN"], [3215, 3220, "ORG"], [3492, 3514, "PLAYER"], [3648, 3653, "ORG"], [3708, 3725, "PLAYER"], [3736, 3741, "ORG"], [3834, 3842, "PLAYER"], [3844, 3848, "PLAYER"], [3876, 3901, "PLAYER"], [3907, 3930, "PLAYER"], [3983, 4000, "TOURN"], [4114, 4133, "TOURN"], [4422, 4442, "PLAYER"], [5093, 5114, "TOURN"], [5269, 5278, "GAME"], [6088, 6107, "TOURN"], [6186, 6194, "PLAYER"], [6384, 6409, "PLAYER"], [6428, 6432, "PLAYER"], [6438, 6443, "PLAYER"], [6567, 6584, "PLAYER"], [6772, 6780, "PLAYER"], [6889, 6893, "PLAYER"], [6898, 6903, "PLAYER"], [6972, 6977, "PLAYER"], [6979, 6985, "PLAYER"], [6991, 7010, "PLAYER"], [7059, 7067, "PLAYER"], [7432, 7437, "PLAYER"], [984, 991, "AVATAR"], [1350, 1355, "TOURN"], [2824, 2843, "ORG"], [3868, 3874, "PLAYER"], [4520, 4539, "TOURN"], [4948, 4957, "TOURN"], [6298, 6314, "TOURN"], [6338, 6357, "TOURN"], [6509, 6525, "TOURN"], [6540, 6559, "TOURN"], [6674, 6684, "GAME"], [7249, 7254, "AVATAR"], [7256, 7264, "AVATAR"], [7270, 7279, "AVATAR"], [7346, 7365, "TOURN"]]}
{"id": 436, "text": "The Houston Outlaws family is getting a little bigger.\nThe popular franchise was acquired last week by the Beasley Media Group, a reflection of the continued commitment from the 58-year-old company to esports. In addition to the Outlaws, Beasley Media produces nationally syndicated esports shows across their platforms of radio stations and online broadcasts.\nI spoke with CEO Caroline Beasley, who has risen to the top of the radio world—she was named the 2017 Radio Executive of the Year in an industry publication—and is now taking the reins on leading her company into the future with esports. The following is an edited version of our conversation.\nWelcome to the Overwatch League! What was it about the league and the Outlaws that interested you?\nThe Overwatch League is best-in-class, and we’re incredibly honored to have this opportunity and be a part of this journey. Beasley became interested in esports about a year ago, and we invested in Team Renegade and have been talking to Blizzard. You think about what has been accomplished over the last three years with the league, and it’s amazing. If you want to be in an esports league, this is the one. When the Outlaws became available, the stars kind of aligned, and we were in a fortunate position to be able to step in and acquire [the team].\nWhy did your company decide to make a push into esports? What has the experience been like?\nLet me make it clear—we’re really excited about esports. We started in traditional radio, and we’re in the business of providing content. Radio and traditional media are aging, and we want to continue to provide content for the future. Esports [gives us] great access to Gen Y and Gen Z, and it’s growing. We’re transforming our company from traditional to digital, and this is another path for us to do that and reach the next generation. As for my experience with esports, I find it very enlightening and encouraging and it gets me excited about the opportunities ahead.\nWhere do you see the Outlaws going from here?\nTo put it in radio terms, the Outlaws already have great ratings. We’re focused on being the best brand in the league, and it’s a very good brand today. We’re thankful we have such a great base to build from, and our focus is on building around the team we have.\nWe’re building from the bottom up, and we want to be a part of the community. We’re definitely a little behind the eight ball—it’s November and our first home game is in February. We have a lot of work to do, but we’re taking our experience in radio and bringing it with us. There’s a lot of similarities between esports and radio and what we’ve done in the last 58 years. Radio does local events, sponsorships, and original content, and that’s what we’re going to do here, too.\nWhat can fans expect from the team in 2020?\nWe have a loyal fanbase, and we want to provide the best experience possible for those fans. There’s a lot of work to do, but we believe we have the resources and experience to bring them that. Our goal is to have events leading up to the season kickoff. We’re excited and we want our fans to be excited as well. It all starts with the team that you build; we aren’t going in just to be mediocre. Bottom line—we want to win.", "meta": {}, "annotation_approver": null, "labels": [[4, 19, "ORG"], [670, 686, "TOURN"], [725, 732, "ORG"], [1171, 1178, "ORG"], [1992, 1999, "ORG"], [2047, 2054, "ORG"], [107, 126, "SPONS"], [229, 236, "ORG"], [754, 774, "TOURN"], [952, 965, "ORG"]]}
{"id": 437, "text": "Jay “Sinatraa” Won is having a moment. On Saturday, at BlizzCon in Anaheim, California, the 19-year-old prodigy added an Overwatch World Cup gold medal to his amazing list of accomplishments in 2019.\nThe Overwatch World Cup victory was historic as the United States beat three-time champions South Korea twice to reach the gold-medal round. Sinatraa and the USA knocked off China to capture the gold. After the final match, Sinatraa won the T-Mobile MVP award for the tournament.\nSinatraa was named Overwatch League MVP at the conclusion of the regular season in September, and went on to help the San Francisco Shock win a league title at the Grand Finals later that month.\nAnd if that wasn’t enough, Sinatraa also made an appearance on the “The Tonight Show Starring Jimmy Fallon” along with teammate Matthew “Super” DeLisi in October.\nSinatraa is in good company in the world of sports, joining Michael Jordan—who won the NBA championship with the Chicago Bulls, was named NBA Finals and league MVP, and won Olympic gold in Barcelona in 1992—and LeBron James, who did the same in 2012, with his gold coming in London and his title with the Miami Heat.", "meta": {}, "annotation_approver": null, "labels": [[0, 18, "PLAYER"], [121, 140, "TOURN"], [204, 223, "TOURN"], [341, 349, "PLAYER"], [424, 432, "PLAYER"], [803, 825, "PLAYER"], [838, 846, "PLAYER"], [480, 489, "PLAYER"], [499, 515, "TOURN"], [598, 617, "ORG"], [702, 710, "PLAYER"]]}
{"id": 438, "text": "On a newsworthy, eye-opening second day of the 2019 Overwatch World Cup, South Korea dropped their first two matches ever in the tournament’s history, while Denmark and the Netherlands continued to show impressive results. Plus, Overwatch 2 was announced, and the six playoff teams were set.\nGroup A, with three pre-seeded teams, was always going to be a bloodbath, but no one could expect that the three-time champions would drop not one, but two group-stage matches. After losing 2-1 to France, South Korea then were swept by Team USA, who didn’t drop a single map en route to the top seed and a quarterfinal bye. Meanwhile, a mostly untested French side proved themselves by going 3-1 and finishing second in the group.\nGroup B was much more competitive, going down to the wire to determine their three seeds. China swept aside the rest of the field, dropping just one map and securing their own bye into the semifinals. Second-seeded Canada, widely expected to medal, crashed out after winning just one map. That left Denmark, the Netherlands, and Russia battling it out for the other two playoff slots—and it was the Danes and the Dutch who made history for their countries, emerging with a chance to test their mettle on the big stage tomorrow.\nHere are the best photos from another exciting day of Overwatch World Cup action:\nIn Overwatch 2 news, check out some of the initial reactions from around the Overwatch League community:", "meta": {}, "annotation_approver": null, "labels": [[47, 71, "TOURN"], [1305, 1324, "TOURN"], [1410, 1426, "TOURN"], [229, 240, "GAME"], [1122, 1128, "PLAYER"], [1136, 1142, "PLAYER"], [1336, 1347, "GAME"]]}
{"id": 439, "text": "It begins. Rosterpalooza 2019. Today marks the time where any free agent may sign with any team of their choosing. In fact, as of last Friday, 32 players out of more than 200 who played last year are officially free agents, and 74 are subject to team option, leaving about 50% of the league under contract for 2020. Of course, this guaranteed half of the league may find themselves changing teams anyway via trades, but let’s not get away from the focus of this article: the excitement and intrigue of a league that may look significantly different next season.\nAs we dive headfirst into the offseason, who are the most intriguing players that are potentially on the market? Now that Player Impact Ratings for the 2019 season are set in stone, I have the perfect tool to help me answer this question.\nLet’s start out by setting some limits on this list of impactful players. First, I’ll be pulling from both the pool of free agents as well as players under team options, as there is no guarantee that teams will exercise those. Second, players will be subject to a maps-played limit, which is already required to be ranked in PIR. Third, since it’s free agency we’re talking about here, I’ve taken some steps to identify players who would usually be at the mercy of their teams’ overall performance by introducing two new PIR-based stats: RPIR and TAPIR.\nPIR, as a quick refresher, is a player rating based on a league-wide average of 100 that is balanced within each patch as the season progresses. PIR is great for ranking players in a large aggregate, but team performance is still a factor in a players’ individual rating, as it ignores that factor entirely. Now, though, I’m proposing a new statistic that attempts to quantify a player’s individual influence on their team’s rating: Relative PIR (RPIR). RPIR is a measure of a player’s PIR as a percentage relative to their team’s average PIR in a season—a handy way of seeing which players on a given team outperformed their team’s average performance and thus identifying diamonds in the rough.\nHowever, RPIR in practice seems to only produce a list of players from bad teams. For a more holistic rating—one that also rewards players who excel on top teams—I’m also proposing Team-Adjusted PIR (TAPIR). TAPIR is simply the product of RPIR and PIR, and provides several paths to good rankings.\nFor example, Houston Outlaws main tank Austin “Muma” Wilmot’s season PIR this season was 104.41, but his RPIR was 111.6% (implying that he out-performed on a below-average team), producing a TAPIR value of 116.51, which was the ninth-highest in the league this season. On the flip side, San Francisco damage Dong-Jun “Rascal” Kim’s PIR was 114.24 and his RPIR was 101.5%, producing a TAPIR of 115.98, good for 12th. The best way to excel in TAPIR is the same as PIR: be the best player on (one of) the best teams. Basically, be like Rookie of the Year Hyo-Jong “Haksal” Kim, whose PIR was 120.62, RPIR was 108.1%, and TAPIR was 130.42.\nTurning back to offseason excitement, here are the top 20 players not currently signed for the 2020 season, ranked by TAPIR:\nOne thing that’s interesting about this top 20 list is the diversity of the cast of players, teams, and contract statuses featured. The Gladiators are among the teams with the most players not under contract, including the leading free agent in TAPIR, Jun-Woo “Void” Kang. After largely successful seasons with Void and Lane “Surefour” Roberts as their leading veterans, will the Gladiators re-sign their now-quantifiable talent? Or will their championship drought prompt them to let their free agents walk, like the Spitfire have done with Jong-Seok “Nus” Kim and Ji-Hyeok “Birdring” Kim?\nWhile the inaugural 12 teams grapple with whether to retain new signings or let old talent go, expansion teams like the Guangzhou Charge and Atlanta Reign find themselves largely deciding who to build around after accumulating a season’s worth of performances. Jun “Erster” Jeong was a revelation for the Reign, especially in 2-2-2 meta, but Petja “Masaa” Kantanen’s performance on Lúcio and later Baptiste was a constant they could rely on. However, with Daniel “FunnyAstro” Hathaway waiting in the wings, Atlanta have a decision to make: which main support do they sell, and which do they keep?\nTAPIR gives players on not-stellar teams a chance to shine, and that’s exactly how players like Finnbjörn “Finnsi” Jónasson, Min-Seok “Aimgod” Kwon, and Harrison “Kruise” Pond made the top 20. While the Eternal, Uprising, and Outlaws all had legitimate chances to make the play-ins this year, they all fell short and ended the season with a bitter taste in their mouths.\nHowever, given their team option status, I’d be surprised if the Eternal and Outlaws let their players walk. Aimgod can do as he pleases, and all signs point to him choosing to do so. Why would Boston have picked up and started Zion “Persia” Yang in place of him if not for reasons of team fit? Regardless, Aimgod’s TAPIR dwarfs his PIR: does this mean he could be the next player whose career rebounds upon leaving the Uprising? Tune in next time, on Rosterpalooza 2019.", "meta": {}, "annotation_approver": null, "labels": [[2363, 2378, "ORG"], [2389, 2409, "PLAYER"], [2658, 2681, "PLAYER"], [2902, 2923, "PLAYER"], [3247, 3257, "ORG"], [3363, 3382, "PLAYER"], [3431, 3455, "PLAYER"], [3422, 3426, "PLAYER"], [3491, 3501, "ORG"], [3628, 3636, "ORG"], [3652, 3671, "PLAYER"], [3676, 3699, "PLAYER"], [3821, 3837, "ORG"], [3842, 3855, "ORG"], [3962, 3980, "PLAYER"], [4006, 4011, "ORG"], [4043, 4065, "PLAYER"], [4157, 4185, "PLAYER"], [4394, 4421, "PLAYER"], [4422, 4445, "PLAYER"], [4451, 4473, "PLAYER"], [4501, 4508, "ORG"], [4510, 4518, "ORG"], [4524, 4531, "ORG"], [4734, 4741, "ORG"], [4746, 4753, "ORG"], [4897, 4915, "PLAYER"], [2637, 2657, "ORG"], [4083, 4088, "AVATAR"], [4099, 4108, "AVATAR"], [4208, 4216, "ORG"], [4863, 4870, "ORG"], [4976, 4982, "PLAYER"], [5089, 5097, "ORG"]]}
{"id": 440, "text": "We recently shared some high-level details about what next season will look like for the Overwatch League, and today we’re excited to share the 2020 schedule—so you can start planning your weekends, your time off, your vacations, your road trips, and your viewing parties!\nWith matches in 19 cities around the world, there will be many chances to join us for a match in 2020. Here’s just a taste of some great opportunities to see the best Overwatch players in the world compete…\nGrab your friends and kick off the season in New York on February 8.\nTake your loved one on a Valentine’s Day date in Shanghai, then catch some matches the next day on the Dragons’ home turf.\nEver wanted to see Seoul in the winter? Head to the heart of esports in early March for the Dynasty’s first home games.\nDon’t put off that dream Paris vacation any longer—book it to coincide with the Eternal’s first home matches on April 11.\nCheer on San Francisco vs. Washington on the Fourth of July... in Vancouver.\nCheck your birthday weeks—and your friends’ birthday weeks—all the way up to the end of the regular season on August 9, 2020.\nMark your calendars now: 2020 tickets go on sale Wednesday, August 28*, on overwatchleague.com.\nStay tuned to your favorite team’s social media accounts for announcements about where their new homes will be—it’ll be your new home, too! In the meantime, join us at Blizzard Arena—home to the play-in tournament and all of the season playoffs up until the Grand Finals in Philadelphia.\n*Tickets will go on sale in China and Korea at a later date.", "meta": {}, "annotation_approver": null, "labels": [[89, 105, "TOURN"], [872, 879, "ORG"], [440, 450, "GAME"], [923, 936, "ORG"], [941, 951, "ORG"]]}
{"id": 441, "text": "The 2019 Overwatch World Cup will take place at BlizzCon in Anaheim, California. The top 10 nations based on results from previous years have been invited, while 36 other countries have an opportunity to join them. In the lead-up to BlizzCon, we will introduce you to the top 10 rosters. Today, it's the first seed, Team South Korea!\n2019 Roster\nDamage:\nJae-Hyeok “Carpe” Lee—Philadelphia Fusion\nMin-Ho “Architect” Park—San Francisco Shock\nHyo-Jong “Haksal” Kim—Vancouver Titans\nTank:\nDong-Gyu “Mano” Kim—New York Excelsior\nHyo-Bin “Choihyobin” Choi—San Francisco Shock\nSupport:\nHo-Jin “IDK” Park—Hangzhou Spark\nSeung-Tae “Bdosin” Choi—London Spitfire\n2019 Committee\nCoach: Dae-Hee \"Crusty\" Park—head coach, San Francisco Shock\nCommunity Manager: Si-Hoon \"Lime\" Park—Scout, Gen.G\nWorld Cup History\n2016: Gold medal\n2017: Gold medal\n2018: Gold medal\nIn a word, South Korea has simply been dominant through the first three Overwatch World Cups. Three tournaments, three golds.\nIf you think maybe this is the year the team steps back, think again. South Korea is, on paper, the most talented team at BlizzCon. This year’s roster features the 2019 Overwatch League Rookie of the Year and the 2019 Grand Finals MVP, plus two other Overwatch League champions. Topping all of that, the team is coached by Crusty, who just proved his bonafides by leading the Shock to the Overwatch League title.\nThey’ve already shown they play to win, so now it’s up to the rest of the field to try to catch up.\nFor more on Team South Korea, follow them on Twitter, and get geared up at our Overwatch World Cup team store.", "meta": {}, "annotation_approver": null, "labels": [[4, 28, "TOURN"], [354, 375, "PLAYER"], [346, 352, "ORG"], [376, 395, "ORG"], [396, 419, "PLAYER"], [420, 439, "ORG"], [440, 461, "PLAYER"], [462, 483, "ORG"], [485, 504, "PLAYER"], [505, 523, "ORG"], [524, 549, "PLAYER"], [579, 596, "PLAYER"], [550, 577, "ORG"], [597, 611, "ORG"], [612, 635, "PLAYER"], [636, 651, "ORG"], [674, 695, "PLAYER"], [708, 727, "ORG"], [774, 779, "ORG"], [921, 942, "TOURN"], [1144, 1160, "TOURN"], [1351, 1356, "ORG"], [1364, 1380, "TOURN"], [1226, 1243, "TOURN"], [1567, 1586, "TOURN"]]}
{"id": 442, "text": "The night before the 2019 Overwatch League Grand Finals in Philadelphia, it rained—the kind of rain that cuts through humidity like a knife. On the morning of the event, though, it was still warm, and the moisture rose from the ground in a mist. It created a haze over the South Philadelphia Sports Complex and the hundreds of diehard Overwatch League fans who arrived early to take part in the outdoors Fan Fest.\nEven before 11 a.m., the Bud Light Payload was surrounded by people in jerseys from across the league, enjoying a cheeky beer with friends, and a sea of people were already participating in the festivities.\nOne of the things that separates us from our flesh-sport counterparts is that our championship match feels like a celebration of our sport as much as the teams participating in the event itself—men, women, and families with young children were all decked out in their favorite team’s merchandise or cosplaying as their favorite Overwatch characters.\nThe Fan Fest was fenced off in a large area by the main entrance, filled with activities and entertainment for every kind of Overwatch League fan. A large replica of the player entrance was set up for fan photos, complete with smoke machines. A girl in a Fragi jersey jumped up and down in anticipation as she waited in line, before finally reaching the front. A member of the Support Crew—the friendly workers helping the crowd throughout the day—took the girl’s swag so she wasn’t loaded down as she went through the entrance, and she hugged him with delight.\nThe unofficial Overwatch League meme lord, Ethan “Stratus” Yankel of the Washington Justice, took some fans with him to do the entrance…well, justice.\nIf you were at Fan Fest early enough, you probably saw Overwatch game director Jeff Kaplan walking around. As he strolled back towards the arena, he passed many fans on their way to join in the festivities.\n“Bro, that’s Jeff Kaplan,” a man in an NYXL jersey stage-whispered, grabbing his friend’s arm.\nA couple holding hands kept it together as they approached Jeff, but broke out into huge grins after he walked by, looking at each other with delight.\nA teenage boy wearing a Genji shirt, walking alone, did a double-take—make that a triple-take—then lit up and broke into a run to join his friends.\nThe lines to get into the arena were long—crazy long—but the crowd was in good spirits. There was a family, the mother in a “Philadelphia Fusion vs. Everybody” shirt and the father in a “Nerf Poko” shirt, hanging out with their son. A Vancouver Titans fan and a Los Angeles Valiant fan who had just met in line struck up a friendly conversation about their favorite caster podcast. Cosplayers rested their props against their legs, and fans of all ages and nationalities clutched their homemade signs and cheerfuls.\nWhen the doors opened, the concourse of the Wells Fargo became a sea of people, a flowing river circling the arena. People lined up at merch booths, and some bought a famous Philly cheesesteak to carry with them to their seats. And when everyone was seated, an incredible universe unfurled in the bowl, a night-sky expanse of tiny lights created by everyone’s LED bracelets. They pulsed to the beat of Zedd’s pre-match concert, flickered madly every time a map went to overtime, and flashed white and orange over and over again as the San Francisco Shock took the title.\nAt that moment, all I could think about—and be grateful for—was how each tiny light represented a person who loves our league. From all over the world, thousands upon thousands descended on Philadelphia to celebrate with us. Each person has their own story, their favorite team, their favorite player, and together we have created a universe—a place we can call our own, no matter who we are or how we cheer.\nWe talk about the Overwatch League being about “the best of us”—the players who have fought all year to prove who among them are worthy to hoist the trophy at the end of the season. On Sunday, the “best of us” included not only the fans who sold out the Wells Fargo Center, but the ones at home, too, and the ones that packed watch parties, the ones that spammed Twitch chat, the ones that talked about it in their Discord communities, the ones that tweeted, and each of the tiny stars that extinguished as the arena emptied into the Philadelphia nighttime.\nYou all are truly the best of us.", "meta": {}, "annotation_approver": null, "labels": [[1348, 1355, "ORG"], [1576, 1598, "PLAYER"], [1606, 1624, "ORG"], [2410, 2429, "ORG"], [2520, 2536, "ORG"], [2547, 2566, "ORG"], [3336, 3356, "ORG"], [3799, 3816, "TOURN"], [335, 351, "TOURN"], [26, 42, "TOURN"], [949, 959, "GAME"], [1096, 1112, "TOURN"], [1548, 1565, "TOURN"], [1739, 1749, "GAME"], [2161, 2167, "AVATAR"], [2477, 2481, "AVATAR"]]}
{"id": 443, "text": "At this point, it seems impossible that anyone would be unaware of the Vancouver Titans' tumultuous journey to the Overwatch League. Once belonging to an amateur Korean team named RunAway, the roster infamously suffered three heartbreaking Grand Finals losses before finally winning a championship for the first time in August 2018 and joining the Titans organization shortly after.\nAs the Overwatch League Grand Finals drew nearer, the question on everybody's mind was: would we see the Titans claim the most important championship of all, or would they collect yet another second-place finish?\nIt was a question that was answered swiftly as the match began. Right from the outset, when the San Francisco Shock shut out the Vancouver Titans on Lijiang Tower—a map that the Titans had been undefeated on in the postseason—the outcome began to feel like a foregone conclusion. All day, the Shock played at a blistering pace, making strategic roster changes on every map and pressing every single advantage they could find. The Titans looked uncharacteristically shaken and unprepared, barely even having a moment to breathe between teamfights, and very quickly found themselves staring down the barrel of a sweep.\nAs the final seconds of overtime on the final map dwindled away, the players of the San Francisco Shock leapt to their feet, throwing themselves at each other and shouting with joy as the Wells Fargo Center lit up in orange and gold. The giant LED screen above their heads declared, in bright, bold lettering: SAN FRANCISCO SHOCK—CHAMPIONS!\nAcross the stage, Rookie of the Year Hyo-Jong “Haksal” Kim took his hands off his keyboard and remained seated, staring wordlessly at the defeat screen, surrounded by orange confetti. His teammates mirrored him, sitting motionless in their chairs and reckoning with the loss that had just been handed to them.\nIt wasn't the loss itself that had sent the Titans reeling; for Haksal, this was his sixth final and his fourth second-place finish. It was the nature of the loss that had taken everyone, from the players to the fans, by surprise. There had been high hopes surrounding the match, with many expecting a close series that would get taken to seven (or even eight) maps. Instead, the Shock ruthlessly dictated the pace of the match, while the Titans struggled to keep up. The match ended after just two hours, with the Shock standing victorious over their biggest rivals.\n“I didn't expect to lose 4-0,” Ju-Seok “Twilight” Lee later said of the scoreline. “We lost too easily.”\nAs the Titans filed in for their post-match press conference, the players looked far more subdued and serious than usual, a rarity for a team usually so boisterous and carefree, even in the face of defeat. Some were downcast, but after having experienced so many losses in finals—including one earlier this year, again to the Shock in Stage 2—it was clear that the mental fortitude they'd built up after all this time was helping keep their emotions in check.\nThe players and staff were careful never to place the blame on anything but their own mistakes, giving short and pointed answers to questions about the heavy loss. As head coach Ji-Sub “Pajion” Hwang put it, “From the point of view of the team that lost, anything we said would sound like an excuse.”\nOften we want our losers to cry or at least be visibly heartbroken, to act as an emotional foil that shows us the cost of the winner's jubilation. But in this case—perhaps also because the nature of their defeat had left the Titans sufficiently stunned—all we got was quiet acceptance that the Shock had simply been the better team.\nOf course the loss had affected the Titans, as any loss on that big a stage would, but watching Haksal and Chung-Hee “Stitch” Lee playfully swat at each other as they sat down, and the hint of a smile that still remained on Sang-Beom “Bumper” Park's perpetually amused face, it was hard to believe that they would be down for very long.\nAt some point during the press conference, Haksal reached out and took Stitch's hand, holding it reassuringly under the table. It was a moment of quiet camaraderie that spoke volumes about these players' history together.\nStitch and Haksal, along with Bumper, have been teammates for close to three years. Their other teammates have been with them for varying lengths of time as well. Together, the team has experienced their fair share of heartbreak, joy, and every emotion in between—and has gotten through all of that to eventually become Overwatch League Grand Finalists in their first season, collecting accolades and records along the way.\nThough the sons of RunAway were ultimately handed yet another second-place finish, they've still accomplished plenty to be proud of this season, and will surely be welcomed home to Vancouver with open arms next year.", "meta": {}, "annotation_approver": null, "labels": [[71, 87, "ORG"], [115, 131, "TOURN"], [348, 354, "ORG"], [488, 494, "TOURN"], [692, 711, "ORG"], [725, 742, "ORG"], [889, 894, "ORG"], [1026, 1032, "ORG"], [1297, 1316, "ORG"], [1523, 1542, "ORG"], [1591, 1612, "PLAYER"], [1908, 1914, "ORG"], [1928, 1934, "PLAYER"], [2244, 2249, "ORG"], [2303, 2309, "ORG"], [2379, 2384, "ORG"], [2463, 2485, "PLAYER"], [2544, 2550, "ORG"], [2863, 2868, "ORG"], [3175, 3196, "PLAYER"], [3667, 3673, "ORG"], [3727, 3733, "PLAYER"], [3738, 3760, "PLAYER"], [3855, 3878, "PLAYER"], [4011, 4017, "PLAYER"], [4039, 4045, "PLAYER"], [4220, 4226, "PLAYER"], [4633, 4640, "ORG"], [390, 406, "TOURN"], [774, 781, "ORG"], [3523, 3529, "ORG"], [3592, 3597, "ORG"], [4190, 4197, "PLAYER"], [4201, 4207, "PLAYER"], [4510, 4526, "TOURN"]]}
{"id": 444, "text": "The San Francisco Shock have won the 2019 Overwatch League championship. The Shock dominated the Vancouver Titans 4-0 on Sunday, in front of a sold-out crowd at Wells Fargo Center in Philadelphia.\nOverwatch League commissioner Pete Vlastelica and Overwatch game director Jeff Kaplan presented the Shock with the championship trophy.\n“This has just been my dream for a long time now,” said Shock damage player Jay “Sinatraa” Won. “All of our teammates… this was their biggest goal, and we made it 4-0.”\nThe Shock added a Grand Finals championship to an already impressive list of season accolades, including a golden stage (28-0 on maps), a stage title, the league MVP, and a 20-0 map win run that led them out of the loser’s bracket and into the record books as the winners of the Overwatch League’s second championship.\n“They’re used to championships, and now we’ve taken our place in the San Francisco sports scene,” said Shock owner Andy Miller. “This is just a group of baby-faced killers that’s just been doing it all year long.”\nHyo-Bin \"Choihyobin\" Choi was named the 2019 Grand Finals MVP presented by T-Mobile. The winner was determined by a combined vote that included 25% from fans and 75% from team coaches, GMs, league casters and analysts, and press who cover the league.\nSan Francisco opened the match strong on Lijiang Tower, capturing the point first. The Titans attempted to slow down Sinatraa’s Doomfist with an early Brigitte pick by Ju-Seok “Twilight” Lee, but had to abandon the strategy as it proved ineffective. Ultimately, the Titans had no answers as the Shock swept them 2-0 to take the first map of the match.\nThe Titans picked Eichenwalde for the second map, and both teams traded impressive attack runs with just two seconds between their time banks. Vancouver’s second attack was turned away by some clutch Pharah play by Dong-Jun \"Rascal\" Kim, who was subbed in for the map. On their attack, the Shock took their time but finally burst through the Titans’ defense to capture the point in Overtime.\nThe Shock entered the first intermission up 2-0 and riding high.\nOn the third map, Temple of Anubis, the teams traded full captures—but on Vancouver’s second attack, the Shock allowed a Point A capture and then shut the door. After an immediate Point A capture, the Shock would not be denied, winning the map and taking a commanding 3-0 match lead.\nOn the fourth map, the Shock put all the pressure on the Titans with a full capture on Gibraltar. Despite a valiant push, Vancouver fell short of the final capture point, locking up the championship for San Francisco.", "meta": {}, "annotation_approver": null, "labels": [[4, 23, "ORG"], [42, 58, "TOURN"], [97, 113, "ORG"], [197, 213, "TOURN"], [389, 394, "ORG"], [409, 427, "PLAYER"], [1035, 1061, "PLAYER"], [1373, 1379, "ORG"], [1403, 1411, "PLAYER"], [1454, 1476, "PLAYER"], [1552, 1558, "ORG"], [1581, 1586, "ORG"], [1642, 1648, "ORG"], [1853, 1874, "PLAYER"], [1928, 1933, "ORG"], [1980, 1986, "ORG"], [2034, 2039, "ORG"], [77, 83, "ORG"], [247, 257, "GAME"], [506, 512, "ORG"], [781, 797, "TOURN"], [924, 930, "ORG"], [1110, 1118, "SPONS"], [1286, 1300, "ORG"], [1414, 1423, "AVATAR"], [1437, 1446, "AVATAR"], [1656, 1668, "AVATAR"], [1838, 1845, "AVATAR"], [2200, 2206, "ORG"], [2296, 2302, "ORG"], [2402, 2408, "ORG"], [2436, 2442, "ORG"], [2501, 2511, "ORG"], [2169, 2181, "ORG"]]}
{"id": 445, "text": "“What’s going on at Mitchell & Ness? They giving something away for free?”\nA man peers incredulously up and down the long lines of people snaking down 12th Street in downtown Philadelphia.\n“It’s for the Overwatch League,” a man in an NYXL jersey replies.\nOn this humid Saturday morning, heat pours from the concrete in the alleyway between Ludlow and Chestnut Streets up into the ragtag crowd of fans. They form an excited line, with men, women, families, and children decked out in Overwatch League team merch that represents a time span from the beginning of the league onward.\nFront and center, just inside the doors, are the two pieces designed exclusively for the Grand Finals in a collaboration between the league and Mitchell & Ness—white long-sleeved shirts, customized on the spot for fans with heat-pressed team logo and event-limited patches. Starting in 2020, Mitchell & Ness and the Overwatch League will team up to release more premium gear for the league as well as individual teams, and today is a sneak peak.\nIt may sound like a curious contrast: the modern aesthetic of the Overwatch League, not quite two years old, and the warm nostalgia of Mitchell & Ness, an athletic apparel company that was established in 1904. The wood-paneled walls of the flagship location are lined with framed jerseys bearing the signatures of famous athletes in traditional sports, while Overwatch League players sign for fans just a few feet away. Years from now, it’s not unimaginable to think Je-Hong “Ryujehong” Ryu’s meticulous, stylish autograph could feel equally iconic to a new generation of fans.\nThere is a sense of history merging here, the passage of time expressed in the merchandise for sale as well as the array of jerseys worn by the 19 players and fans passing through. How far we’ve come, here in the humidity of Philadelphia before the second Overwatch League Grand Finals, and how far we have yet to go.", "meta": {}, "annotation_approver": null, "labels": [[203, 219, "TOURN"], [1493, 1516, "PLAYER"], [483, 499, "TOURN"], [896, 913, "TOURN"], [1860, 1876, "TOURN"], [1385, 1401, "TOURN"], [872, 887, "SPONS"], [724, 739, "SPONS"], [20, 35, "SPONS"], [1092, 1108, "TOURN"], [1161, 1176, "SPONS"]]}
{"id": 446, "text": "Charlie “Nero” Zwarg, Guangzhou Charge\nI think both teams are very even in this meta, but I think the Shock’s coaching staff will give them the edge.\nCorey “Corey” Nigra, Washington Justice\nBoth teams seem to be extremely strong in this meta, so it’s hard to be certain who’s going to win. My choice is the Shock because of their hot streak and how fast they adapt to any meta that is thrown at them; they have a tremendously high level of mechanical skill. Either way, I definitely want my Overwatch World Cup teammates—Grant “Moth” Espe, Jay “Sinatraa” Won, and Matthew “Super” DeLisi—to get the win!\nDante “Danteh” Cruz, Houston Outlaws\nI think the Shock will win because of their amazing players and coaching. They're all such hard workers with lots of talent. I'm really excited to see them play in the Grand Finals.\nDusttin “Dogman” Bowerman, Atlanta Reign\nI think the Shock are going to win. They have momentum coming into the Grand Finals and that should give them an edge.\nHarrison “Kruise” Pond, Paris Eternal\nI'm not sure. The match is going to be really close. Both teams are great, but I think the Shock have been on another level recently. Being knocked into the loser’s bracket made them angry and brought something extra out of them—and because of that they're going to win.\nJeffrey “Blasé” Tsang, Boston Uprising\nMy Grand Finals pick is going to be the Shock because those guys work extremely hard. They never give up and always try hard no matter the opponent. Honestly, they possess all the qualities you want in a team.\nIndy “Space” Halpern, Los Angeles Valiant\nI’d go for Shock because of how convincing their playoffs run was, and since Sinatraa is an absolute monster when it matters most.\nJae-Hui “Gesture” Hong, London Spitfire\nThe Shock will win because their strategy and teamwork are really good.\nJae-Hyeok “Carpe” Lee, Philadelphia Fusion\nI think the Shock will win based on how they’ve played. I believe they are the stronger team.Je-Hong “Ryujehong” Ryu, Seoul Dynasty\nThe Shock have good strategy, but Vancouver always performs well on stage. I think Vancouver will win.Jeong-Woo “Sayaplayer” Ha, Florida Mayhem\nI think the Shock will win the Grand Finals because when I was scrimming against them during the season, they could play any meta that is given to them and they had good chemistry and teamwork.Lane “Surefour” Roberts, Los Angeles Gladiators\nThe Shock will win because they seem like a team that has strong trust between the players. They have an idea of how they want to play, or just listen to each other, which makes them strong and consistent.Liam “Mangachu” Campbell, Toronto Defiant\nI'm choosing the Shock to win. They ran through the loser’s bracket like a train, and I don't think Vancouver has a chance to stop them. As much as I want a Canadian team to win, I can't see them taking it with the way the Shock are currently playing.Menghan “Ameng” Ding, Chengdu Hunters\nMin-Seok “OGE” Son, Dallas Fuel\nI want to pick the Shock because they have a great team of players. The Titans do too, but I think the Shock have better strategy.Both are possible. This is going to be an extremely close match.Quilin “Guxue” Xu, Hangzhou Spark\nThe Shock will be the champions. They have a more stable lineup and their roster is deeper. Also, the Shock came back from the loser’s bracket, which showed a lot of toughness. Last but not least, the Shock have the advantage in the Bastion meta.Seong-Hyun “Jjonak” Bang, New York Excelsior\nI think Vancouver will win because they always pop off on stage.Young-Jin “Gamsu” Noh, Shanghai Dragons\nI think the Shock will win because they have the strongest damage duos in the league right now.The 2019 Overwatch League Grand Finals takes place Sept. 29 at Wells Fargo Center in Philadelphia and will air live on ABC and be livestreamed on Twitch, overwatchleague.com, and the Overwatch League app. Get the latest Grand Finals news and information here, and sign up for league newsletter updates here.", "meta": {}, "annotation_approver": null, "labels": [[0, 20, "PLAYER"], [22, 38, "ORG"], [102, 107, "ORG"], [150, 169, "PLAYER"], [171, 189, "ORG"], [307, 312, "ORG"], [491, 510, "TOURN"], [521, 538, "PLAYER"], [540, 558, "PLAYER"], [564, 586, "PLAYER"], [603, 622, "PLAYER"], [624, 639, "ORG"], [652, 657, "ORG"], [822, 847, "PLAYER"], [849, 862, "ORG"], [875, 880, "ORG"], [982, 1004, "PLAYER"], [1006, 1019, "ORG"], [1111, 1116, "ORG"], [1291, 1312, "PLAYER"], [1314, 1329, "ORG"], [1540, 1560, "PLAYER"], [1562, 1581, "ORG"], [1593, 1598, "ORG"], [1659, 1667, "PLAYER"], [1713, 1735, "PLAYER"], [1737, 1752, "ORG"], [1757, 1762, "ORG"], [1825, 1846, "PLAYER"], [1848, 1867, "ORG"], [1961, 1984, "PLAYER"], [1986, 1999, "ORG"], [2102, 2127, "PLAYER"], [2128, 2143, "ORG"], [2156, 2161, "ORG"], [2337, 2360, "PLAYER"], [2362, 2384, "ORG"], [2389, 2394, "ORG"], [2590, 2614, "PLAYER"], [2616, 2631, "ORG"], [2649, 2654, "ORG"], [2883, 2903, "PLAYER"], [2905, 2920, "ORG"], [2921, 2939, "PLAYER"], [2941, 2952, "ORG"], [2972, 2977, "ORG"], [3025, 3031, "ORG"], [3056, 3061, "ORG"], [3147, 3164, "PLAYER"], [3166, 3180, "ORG"], [3185, 3190, "ORG"], [3427, 3451, "PLAYER"], [3453, 3471, "ORG"], [3536, 3557, "PLAYER"], [3559, 3575, "ORG"], [3588, 3593, "ORG"], [3675, 3696, "TOURN"], [1370, 1376, "ORG"], [1880, 1886, "ORG"], [2004, 2010, "ORG"], [2034, 2044, "ORG"], [2083, 2093, "ORG"], [2732, 2742, "ORG"], [2855, 2860, "ORG"], [3382, 3388, "ORG"], [3414, 3422, "AVATAR"], [3480, 3490, "ORG"], [3854, 3870, "TOURN"]]}
